Repository: zkasman/geonode
Catalog: geonode/locale/*/LC_MESSAGES/django.po
Languages: my

source: Request to download a resource
my: Permintaan untuk memuat turun sumber

source: A request for downloading a resource was sent
my: Permintaan untuk memuat turun sumber telah dihantar

source: Request resource change
my: Minta perubahan sumber

source: Owner has requested permissions to modify a resource
my: Pemilik telah meminta hak akses untuk mengubah suai sumber

source: series
my: siri

source: computer program or routine
my: program komputer

source: feature type
my: jenis ciri

source: copy or imitation of an existing or hypothetical object
my: salinan atau tiruan objek sedia ada atau hipotesis

source: collection hardware
my: kumpulan perangkat keras

source: collection session
my: sesi pengumpulan

source: non-geographic data
my: data bukan geografi

source: property type
my: jenis property

source: field session
my: sesi field

source: dataset
my: set data

source: service interfaces
my: antara muka servis

source: attribute class
my: kelas atribut

source: characteristic of a feature
my: ciri karekteristik

source: tile or spatial subset of geographic data
my: subset spasial data geografi

source: feature
my: ciri

source: dimension group
my: dimensi kumpulan

source: frequency of maintenance for the data is not known
my: kekerapan penyelenggaraan untuk data tidak diketahui

source: data is repeatedly and frequently updated
my: data selalu diperbaharui

source: there are no plans to update the data
my: tidak ada rencana untuk memperbaharui data

source: data is updated each day
my: data diperbaharui setiap hari

source: data is updated every year
my: data diperbaharui setiap tahun

source: data is updated as deemed necessary
my: data diperbaharui apabila dianggap penting

source: data is updated each month
my: data diperbaharui setiap bulan

source: data is updated every two weeks
my: data diperbaharui setiap dua minggu

source: data is updated in intervals that are uneven in duration
my: data diperbaharui secara berkala

source: data is updated on a weekly basis
my: data diperbaharui setiap minggu

source: data is updated twice each year
my: data diperbaharui dua kali dalam setahun

source: data is updated every three months
my: data diperbaharui setiap tiga bulan sekali

source: No information provided
my: Tiada maklumat diberikan

source: Category is required.
my: Kategori diperlukan.

source: Keywords from Thesaurus
my: Kata kunci daripada Tesaurus

source: List of keywords from Thesaurus
my: Senarai kata kunci daripada Tesaurus

source: Abstract
my: Abstrak

source: Purpose
my: Tujuan

source: Other constraints
my: Kekangan lain

source: Supplemental information
my: Maklumat tambahan

source: Data quality statement
my: Pernyataan kualiti data

source: Owner
my: Pemilik

source: Date
my: Tarikh

source: temporal extent start
my: peringkat temporal bermula

source: temporal extent end
my: tahap temporal berakhir

source: Person outside GeoNode (fill form)
my: Orang di luar GeoNode (isi borang)

source: Point of Contact
my: Hubungi

source: Metadata Author
my: Metadata Pengarang

source: Free-text Keywords
my: Kata kunci teks bebas

source: A space or comma-separated list of keywords. Use the widget to select from Hierarchical tree.
my: Ruang atau senarai kata kunci yang dipisahkan koma. Gunakan widget untuk memilih daripada pokok Hierarki.

source: Regions
my: Wilayah

source: Group
my: Kumpulan

source: Category
my: Kategori

source: License
my: Lesen

source: Language
my: Bahasa

source: User
my: Pengguna

source: Permission Type
my: Jenis Hak Akses

source: Mode
my: Mod

source: Resource
my: Sumber

source: Reason
my: Alasan

source: Short reasoning behind the request
my: Alasan ringkas di sebalik permintaan itu

source: function performed by the responsible party
my: fungsi yang dilakukan oleh pihak yang bertanggungjawab

source: brief narrative summary of the content of the resource(s)
my: ringkasan naratif ringkas tentang kandungan sumber

source: reference date for the cited resource
my: tarikh rujukan untuk sumber yang disebut

source: identification of when a given event occurred
my: pengenalpastian apabila sesuatu kejadian berlaku

source: version of the cited resource
my: versi sumber

source: authority or function assigned, as to a ruler, legislative assembly, delegate, or the like.
my: kuasa atau fungsi yang diberikan, seperti kepada pemerintah, dewan perundangan, perwakilan, atau seumpamanya.

source: a DOI will be added by Admin before publication.
my: DOI akan ditambah oleh Pentadbir sebelum diterbitkan.

source: summary of the intentions with which the resource(s) was developed
my: ringkasan hasrat dengan mana sumber itu dibangunkan

source: frequency with which modifications and deletions are made to the data after it is first produced
my: kekerapan pengubahsuaian dan pemadaman dibuat pada data selepas ia pertama kali dihasilkan

source: commonly used word(s) or formalised word(s) or phrase(s) used to describe the subject (space or comma-separated)
my: perkataan yang biasa digunakan atau perkataan atau frasa rasmi yang digunakan untuk menerangkan subjek (ruang atau dipisahkan koma)

source: formalised word(s) or phrase(s) from a fixed thesaurus used to describe the subject (space or comma-separated)
my: perkataan atau frasa rasmi daripada tesaurus tetap yang digunakan untuk menerangkan subjek (ruang atau dipisahkan koma)

source: keyword identifies a location
my: kata kunci mengenal pasti lokasi

source: limitation(s) placed upon the access or use of the data.
my: had (s) diletakkan pada capaian atau penggunaan data.

source: other restrictions and legal prerequisites for accessing and using the resource or metadata
my: sekatan lain dan prasyarat undang-undang untuk mengakses dan menggunakan sumber atau metadata

source: license of the dataset
my: lesen set data

source: language used within the dataset
my: bahasa yang digunakan dalam dataset

source: high-level geographic data thematic classification to assist in the grouping and search of available geographic data sets.
my: tingkat tinggi data geografis klasifikasi tematik untuk membantu dalam pengelompokan dan pencarian yang tersedia set data geografis.

source: method used to represent geographic information in the dataset.
my: kaedah yang digunakan untuk mewakili maklumat geografi dalam set data.

source: time period covered by the content of the dataset (start)
my: tempoh masa yang diliputi oleh kandungan set data (mula)

source: time period covered by the content of the dataset (end)
my: tempoh masa yang diliputi oleh kandungan set data (akhir)

source: general explanation of the data producer's knowledge about the lineage of a dataset
my: penjelasan umum tentang pengetahuan pengeluar data tentang keturunan set data

source: title
my: tajuk

source: name by which the cited resource is known
my: nama sumber diketahui

source: abstract
my: abstrak

source: purpose
my: tujuan

source: date
my: tarikh

source: date type
my: jenis tarikh

source: edition
my: edisi

source: Attribution
my: Atribusi

source: maintenance frequency
my: kekerapan penyelenggaraan

source: keywords
my: kata kunci

source: keywords region
my: kata kunci wilayah

source: restrictions
my: batasan

source: restrictions other
my: batasan lain

source: language
my: bahasa

source: spatial representation type
my: jenis perwakilan spatial

source: supplemental information
my: informasi tambahan

source: any other descriptive information about the dataset
my: informasi lainnya mengenai dataset

source: data quality statement
my: pernyataan kualiti data

source: CSW source
my: CSW sumber

source: CSW insert date
my: tarikh masukkan CSW

source: CSW type
my: jenis CSW

source: Metadata uploaded preserve
my: Metadata yang dimuat naik simpan

source: Featured
my: Diterampilkan

source: Should this resource be advertised in home page?
my: Haruskah sumber daya ini akan diiklankan di halaman rumah?

source: Is Published
my: Telah Diterbitkan

source: Should this resource be published and searchable?
my: Patutkah sumber ini diterbitkan dan boleh dicari?

source: Approved
my: Diluluskan

source: Is this resource validated from a publisher or editor?
my: Adakah sumber ini disahkan daripada penerbit atau editor?

source: Thumbnail url
my: URL thumbnail

source: Dirty State
my: Keadaan Kotor

source: Security Rules Are Not Synched with GeoServer!
my: Peraturan Keselamatan Tidak Diselaraskan dengan GeoServer!

source: Resource Type
my: Jenis Sumber

source: If true, will be excluded from search
my: Jika benar, akan dikecualikan daripada carian

source: For example "kml"
my: Sebagai contoh "kml"

source: For example "View in Google Earth"
my: Sebagai contoh "Tampilkan di Google Earth"

source: For example "text/xml"
my: Sebagai contoh "text/xml"

source: About
my: Tentang

source: Responsible, Point of Contact, Metadata Author
my: Tanggungjawab, Tempat Perhubungan, Pengarang Metadata

source: Responsible
my: Tanggungjawab

source: Title
my: Tajuk

source: For more info see
my: Untuk maklumat lanjut lihat

source: Creation Date
my: Tarikh Penciptaan

source: Publication Date
my: Tarikh penerbitan

source: Revision Date
my: Tarikh Semakan

source: Type
my: Jenis

source: Keywords
my: Kata Kunci

source: More info
my: Maklumat lanjut

source: Maintenance Frequency
my: Kekerapan Penyelenggaraan

source: Restrictions
my: Batasan

source: Edition
my: Edisi

source: Data Quality
my: Kualiti Data

source: Supplemental Information
my: Informasi tambahan

source: Spatial Representation Type
my: Jenis Perwakilan Spatial

source: No content created yet.
my: Tiada kandungan dibuat lagi.

source: Temporal Serie
my: Siri Temporal

source: Select
my: Pilih

source: Service is
my: Servis adalah

source: online
my: dalam talian

source: offline
my: luar talian

source: SECURITY NOT YET SYNCHRONIZED
my: KESELAMATAN BELUM DISEGERAKAN

source: Sync permissions immediately
my: Segerakan hak akses serta-merta

source: PENDING APPROVAL
my: KELULUSAN TERTANGGUH

source: UNPUBLISHED
my: TIDAK DITERBITKAN

source: Create a Map
my: Buat Peta

source: View Map
my: Lihat Peta

source: Batch Edit
my: Suntingan Berkumpulan

source: Cancel
my: Batal

source: Submit
my: Proses

source: Set Permissions
my: Tetapkan Hak Akses

source: Discover the available datasets.
my: Temui set data yang tersedia.

source: Upload a Thumbnail
my: Muat naik Thumbnail

source: Remove (and use auto generated thumbnail)
my: Buang (dan gunakan thumbnail yang dijana secara automatik)

source: Upload
my: Muat naik

source: Auto generated thumbnail
my: Thumbnail yang dijana secara automatik

source: Raster Layer
my: Lapisan Data Raster

source: Vector Layer
my: Lapisan Data Vektor

source: Vector Temporal Serie
my: Siri Temporal Vektor

source: Remote Layer
my: Lapisan Data Remote

source: WMS Cascade Layer
my: Lapisan WMS Cascade

source: me
my: saya

source: System message: A request to modify resource
my: Mesej sistem: Permintaan untuk mengubah suai sumber

source: The resource owner has requested to modify the resource
my: Pemilik sumber telah meminta untuk mengubah suai sumber

source: Resource title
my: Tajuk sumber

source: Reason for the request
my: Sebab permintaan itu

source: To allow the change, set the resource to not "Approved" under the metadata settingsand write message to the owner to notify him
my: Untuk membenarkan perubahan, tetapkan sumber kepada tidak "Diluluskan" di bawah tetapan metadata dan tulis mesej kepada pemilik untuk memberitahunya

source: Resource Metadata
my: Metadata Sumber

source: Resource ID
my: ID Sumber

source: Start
my: Mula

source: End
my: Tamat

source: Extent
my: Luasnya

source: Spatial Reference System Identifier
my: Pengecam Sistem Rujukan Spatial

source: Attributes
my: Atribut

source: Attribute name
my: Nama Atribut

source: Description
my: Deskripsi

source: GeoNode Client Library
my: Perpustakaan Pelanggan GeoNode

source: Flora and/or fauna in natural environment. Examples: wildlife, vegetation, biological sciences, ecology, wilderness, sealife, wetlands, habitat.
my: Flora dan/atau fauna dalam persekitaran semula jadi. Contoh: hidupan liar, tumbuh-tumbuhan, sains biologi, ekologi, hutan belantara, hidupan laut, tanah lembap, habitat.

source: Legal land descriptions. Examples: political and administrative boundaries.
my: Perihal tanah undang-undang. Contoh: sempadan politik dan pentadbiran.

source: Boundaries
my: Sempadan

source: Processes and phenomena of the atmosphere. Examples: cloud cover, weather, climate, atmospheric conditions, climate change, precipitation.
my: Proses dan fenomena atmosfera. Contoh: litupan awan, cuaca, iklim, keadaan atmosfera, perubahan iklim, hujan.

source: Climatology Meteorology Atmosphere
my: Klimatologi Meteorologi Atmosfera

source: Economic activities, conditions and employment. Examples: production, labour, revenue, commerce, industry, tourism and ecotourism, forestry, fisheries, commercial or subsistence hunting, exploration and exploitation of resources such as minerals, oil and gas.
my: Aktiviti ekonomi, keadaan dan pekerjaan. Contoh: pengeluaran, buruh, hasil, perdagangan, industri, pelancongan dan ekopelancongan, perhutanan, perikanan, pemburuan komersial atau sara diri, penerokaan dan eksploitasi sumber seperti galian, minyak dan gas.

source: Economy
my: Ekonomi

source: Height above or below sea level. Examples: altitude, bathymetry, digital elevation models, slope, derived products.
my: Ketinggian di atas atau di bawah paras laut. Contoh: ketinggian, batimetri, model ketinggian digital, cerun, produk terbitan.

source: Elevation
my: Ketinggian

source: Environmental resources, protection and conservation. Examples: environmental pollution, waste storage and treatment, environmental impact assessment, monitoring environmental risk, nature reserves, landscape.
my: Sumber alam sekitar, perlindungan dan pemuliharaan. Contoh: pencemaran alam sekitar, penyimpanan dan rawatan sisa, penilaian kesan alam sekitar, pemantauan risiko alam sekitar, rizab alam semula jadi, landskap.

source: Environment
my: Persekitaran

source: Rearing of animals and/or cultivation of plants. Examples: agriculture, irrigation, aquaculture, plantations, herding, pests and diseases affecting crops and livestock.
my: Penternakan haiwan dan/atau penanaman tumbuhan. Contoh: pertanian, pengairan, akuakultur, perladangan, penggembalaan, perosak dan penyakit yang menjejaskan tanaman dan ternakan.

source: Farming
my: Berkebun

source: Information pertaining to earth sciences. Examples: geophysical features and processes, geology, minerals, sciences dealing with the composition, structure and origin of the earth s rocks, risks of earthquakes, volcanic activity, landslides, gravity information, soils, permafrost, hydrogeology, erosion.
my: Maklumat berkaitan sains bumi. Contoh: ciri dan proses geofizik, geologi, mineral, sains yang berkaitan dengan komposisi, struktur dan asal usul batuan bumi, risiko gempa bumi, aktiviti gunung berapi, tanah runtuh, maklumat graviti, tanah, permafrost, hidrogeologi, hakisan.

source: Geoscientific Information
my: Maklumat Geosaintifik

source: Health, health services, human ecology, and safety. Examples: disease and illness, factors affecting health, hygiene, substance abuse, mental and physical health, health services.
my: Kesihatan, perkhidmatan kesihatan, ekologi manusia, dan keselamatan. Contoh: penyakit dan penyakit, faktor yang mempengaruhi kesihatan, kebersihan, penyalahgunaan bahan, kesihatan mental dan fizikal, perkhidmatan kesihatan.

source: Health
my: Kesihatan

source: Base maps. Examples: land cover, topographic maps, imagery, unclassified images, annotations.
my: Peta asas. Contoh: tutupan tanah, peta topografi, imejan, imej tidak dikelaskan, anotasi.

source: Imagery Base Maps Earth Cover
my: Peta Asas Imejan Litupan Bumi

source: Inland water features, drainage systems and their characteristics. Examples: rivers and glaciers, salt lakes, water utilization plans, dams, currents, floods, water quality, hydrographic charts.
my: Ciri-ciri air pedalaman, sistem saliran dan ciri-cirinya. Contoh: sungai dan glasier, tasik garam, rancangan penggunaan air, empangan, arus, banjir, kualiti air, carta hidrografi.

source: Inland Waters
my: Perairan Pedalaman

source: Military bases, structures, activities. Examples: barracks, training grounds, military transportation, information collection.
my: Pangkalan tentera, struktur, aktiviti. Contoh: berek, tempat latihan, pengangkutan tentera, pengumpulan maklumat.

source: Intelligence Military
my: Perisikan Tentera

source: Positional information and services. Examples: addresses, geodetic networks, control points, postal zones and services, place names.
my: Maklumat kedudukan dan perkhidmatan. Contoh: alamat, rangkaian geodetik, titik kawalan, zon dan perkhidmatan pos, nama tempat.

source: Location
my: Lokasi

source: Features and characteristics of salt water bodies (excluding inland waters). Examples: tides, tidal waves, coastal information, reefs.
my: Ciri dan ciri badan air masin (tidak termasuk perairan pedalaman). Contoh: pasang surut, ombak pasang surut, maklumat pantai, terumbu.

source: Oceans
my: Lautan

source: Information used for appropriate actions for future use of the land. Examples: land use maps, zoning maps, cadastral surveys, land ownership.
my: Maklumat yang digunakan untuk tindakan yang sesuai untuk kegunaan masa hadapan tanah. Contoh: peta guna tanah, peta zon, ukur kadaster, pemilikan tanah.

source: Planning Cadastre
my: Kadaster Perancangan

source: Settlements, anthropology, archaeology, education, traditional beliefs, manners and customs, demographic data, recreational areas and activities, social impact assessments, crime and justice, census information. Economic activities, conditions and employment.
my: Petempatan, antropologi, arkeologi, pendidikan, kepercayaan tradisional, adab dan adat resam, data demografi, kawasan dan aktiviti rekreasi, penilaian kesan sosial, jenayah dan keadilan, maklumat bancian. Aktiviti ekonomi, keadaan dan pekerjaan.

source: Population
my: Penduduk

source: Characteristics of society and cultures. Examples: settlements, anthropology, archaeology, education, traditional beliefs, manners and customs, demographic data, recreational areas and activities, social impact assessments, crime and justice, census information.
my: Ciri-ciri masyarakat dan budaya. Contoh: penempatan, antropologi, arkeologi, pendidikan, kepercayaan tradisional, adab dan adat resam, data demografi, kawasan dan aktiviti rekreasi, penilaian impak sosial, jenayah dan keadilan, maklumat bancian.

source: Society
my: Masyarakat

source: Man-made construction. Examples: buildings, museums, churches, factories, housing, monuments, shops, towers.
my: Pembinaan buatan manusia. Contoh: bangunan, muzium, gereja, kilang, perumahan, monumen, kedai, menara.

source: Structure
my: Struktur

source: Means and aids for conveying persons and/or goods. Examples: roads, airports/airstrips, shipping routes, tunnels, nautical charts, vehicle or vessel location, aeronautical charts, railways.
my: Alat dan bantuan untuk mengangkut orang dan/atau barang. Contoh: jalan raya, lapangan terbang/lapangan terbang, laluan perkapalan, terowong, carta nautika, lokasi kenderaan atau kapal, carta aeronautik, kereta api.

source: Transportation
my: Pengangkutan

source: Energy, water and waste systems and communications infrastructure and services. Examples: hydroelectricity, geothermal, solar and nuclear sources of energy, water purification and distribution, sewage collection and disposal, electricity and gas distribution, data communication, telecommunication, radio, communication networks.
my: Tenaga, air dan sistem sisa serta infrastruktur dan perkhidmatan komunikasi. Contoh: hidroelektrik, geoterma, solar dan sumber tenaga nuklear, pembersihan dan pengagihan air, pengumpulan dan pelupusan kumbahan, pengagihan elektrik dan gas, komunikasi data, telekomunikasi, radio, rangkaian komunikasi.

source: Utilities Communication
my: Komunikasi Utiliti

source: Document Created
my: Dokumen Dibuat

source: A Document was created
my: Satu Dokumen telah dibuat

source: Document Updated
my: Dokumen dikemas kini

source: A Document was updated
my: Dokumen berikut telah dikemas kini

source: Document Approved
my: Dokumen berikut telah diluluskan

source: A Document was approved by a Manager
my: Dokumen berikut telah diluluskan oleh Pengurus

source: Document Published
my: Dokumen Diterbitkan

source: A Document was published
my: Dokumen berikut telah diterbitkan

source: Document Deleted
my: Dokumen Dipadamkan

source: A Document was deleted
my: Dokumen berikut telah dipadamkan

source: Comment on Document
my: Komen pada Dokumen

source: A Document was commented on
my: Dokumen berikut telah diulas

source: Rating for Document
my: Penilaian untuk Dokumen

source: A rating was given to a document
my: Penarafan diberikan kepada dokumen

source: Width
my: Lebar

source: Height
my: Tinggi

source: Make
my: Buat

source: Latitude
my: Latitud

source: Not specified
my: Tidak dinyatakan

source: Longitude
my: Longitud

source: Flash
my: Kilat

source: True
my: Betul

source: False
my: Salah

source: Speed Rating
my: Penilaian Laju

source: Link to
my: Pautan ke

source: Document must be a file or url.
my: Dokumen harus file atau url.

source: A document cannot have both a file and a url.
my: Sebuah dokumen tidak dapat memiliki dua file dan url.

source: This file type is not allowed
my: Jenis file ini tidak diperbolehkan

source: Permissions must be valid JSON.
my: Hak akses mestilah JSON yang sah.

source: File
my: Fail

source: The URL of the document if it is external.
my: URL dokumen jika ia luaran.

source: Your browser does not support the audio element.
my: Web Pelayar anda tidak menyokong elemen audio.

source: Your browser does not support the video tag.
my: Web Pelayar anda tidak menyokong tag video.

source: Download the
my: Muat turun

source: document
my: dokumen

source: External Resource
my: Sumber Luaran

source: Rate this document
my: Beri penilaian untuk dokumen ini

source: Average Rating
my: Penilaian purata

source: Metadata Detail
my: Butiran Metadata

source: Download Document
my: Muat turun Dokumen

source: Request Download
my: Minta Muat Turun

source: Edit Document
my: Edit Dokumen

source: Request change
my: Minta perubahan

source: Advanced Edit
my: Suntingan Lanjutan

source: Document
my: Dokumen

source: Replace
my: Ganti

source: Remove
my: Buang

source: Close
my: Tutup

source: Download Metadata
my: Muat turun Metadata

source: Full metadata
my: Metadata penuh

source: Text format
my: Format teks

source: HTML format
my: format HTML

source: Standard Metadata - XML format
my: Metadata Standard - Format XML

source: Resources using this document
my: Sumber menggunakan dokumen ini

source: List of resources using this document:
my: Senarai sumber menggunakan dokumen ini:

source: This document is not related to any maps or layers
my: Dokumen ini tidak berhubungan dengan peta atau layer

source: Permissions
my: Hak Akses

source: Click the button below to change the permissions of this document.
my: Klik butang di bawah untuk menukar hak akses dokumen ini.

source: Change Document Permissions
my: Tukar Hak Akses Dokumen

source: Explore Documents
my: Lihat Dokumen

source: Upload Documents
my: Muat Naik Dokumen

source: for %(document_title)s
my: untuk %(document_title)s

source: Completeness
my: Kesempurnaan

source: Metadata Schema mandatory fields completed
my: Medan wajib Skema Metadata telah dilengkapkan

source: Check Schema mandatory fields
my: Semak medan wajib Skema

source: Error updating metadata. Please check the following fields:
my: Ralat mengemas kini metadata. Sila semak medan berikut:

source: Done
my: Selesai

source: Metadata Provider
my: Pembekal Metadata

source: << Back
my: << Kembali
