Repository: zkasman/geonode
Catalog: geonode/locale/*/LC_MESSAGES/django.po
Languages: my

source: Available styles
my: Style yang tersedia

source: Click on an available style in the upper box to assign it to this layer. Selected styles appear in the lower box.
my: Klik pada stail yang tersedia dalam kotak atas untuk menetapkannya pada lapisan data ini. Gaya yang dipilih muncul dalam kotak bawah.

source: Update Available Styles
my: Ubah tamplan layer

source: Upload Layer Style
my: Muat naik Stail Lapisan Data

source: WARNING
my: AMARAN

source: This will most probably overwrite the current default style!
my: Ini kemungkinan besar akan mengganti stail default semasa!

source: Preview
my: Tampilan Cetak

source: Dataset Attributes
my: Atribut Set Data

source: Upload Layer
my: Muat Naik Lapisan Data

source: Upload status
my: Status Muat Naik

source: This file needs additional configuration to complete the upload process. Please click on the button to fill the required configuration
my: Fail ini memerlukan konfigurasi tambahan untuk melengkapkan proses muat naik. Sila klik pada butang untuk mengisi konfigurasi yang diperlukan

source: Delete
my: Padam

source: Upload process completed
my: Proses muat naik selesai

source: The upload process cannot be completed because the original file is no more available
my: Proses muat naik tidak dapat diselesaikan kerana fail asal tidak tersedia lagi

source: Created
my: Dicipta

source: Progress
my: Progres

source: page
my: halaman

source: of
my: dari

source: Delete incomplete upload
my: Padamkan muat naik yang tidak lengkap

source: Are you sure you want to remove this incomplete upload?
my: Adakah anda pasti mahu membuang muat naik yang tidak lengkap ini?

source: Upload Layer Step: Set SRS
my: Langkah Muat Naik Lapisan Data: Tetapkan SRS

source: Provide CRS for
my: Sediakan CRS untuk

source: Coordinate Reference System
my: Sistem Rujukan Koordinat

source: A coordinate reference system for this layer could not be determined. Locate or enter the appropriate ESPG code for this layer below. One way to do this is do visit: <a href="http://prj2epsg.org/search" target="_">prj2epsg</a> and enter the following:
my: Sistem rujukan koordinat untuk lapisan data ini tidak dapat ditentukan. Cari atau masukkan kod ESPG yang sesuai untuk lapisan ini di bawah. Satu cara untuk melakukan ini ialah melawat: <a href="http://prj2epsg.org/search" target="_">prj2epsg</a> dan masukkan yang berikut:

source: Native CRS could not be found!
my: CRS asli tidak ditemui!

source: Provide EPSG code for Source SRS
my: Sediakan kod EPSG untuk Sumber SRS

source: EPSG Code (Source SRS)
my: Kod EPSG (Sumber SRS)

source: Select a Source SRS
my: Pilih SRS Sumber

source: Source SRS EPSG Code is mandatory and represents the native data Spatial Reference System. <br><br> This must be coherent with the Geometry values (lon/lat coordinates as an instance) stored on the geospatial dataset. <br><br> If not specified on the geospatial data itself, it must be manually declared by the operator. <br><br> More information is provided at the bottom of the page in the "Additional Help" sections.
my: Sumber Kod SRS EPSG adalah wajib dan mewakili Sistem Rujukan Spatial data asli.<br><br> Ini mesti koheren dengan nilai Geometri (koordinat lon/lat sebagai contoh) yang disimpan pada set data geospatial.<br><br> Jika tidak dinyatakan pada data geospatial itu sendiri, ia mesti diisytiharkan secara manual oleh pengendali.<br><br> Maklumat lanjut disediakan di bahagian bawah halaman dalam bahagian "Bantuan Tambahan".

source: Next
my: Selanjutnya

source: Advanced Options
my: Pilihan Lanjutan

source: Target SRS
my: Sasaran SRS

source: EPSG Code (Target SRS)
my: Kod EPSG (Sasaran SRS)

source: Select a Target SRS
my: Pilih SRS Sasaran

source: leave it empty to use only Source SRS
my: biarkan kosong untuk menggunakan SRS Sumber sahaja

source: Additional Help
my: Bantuan Tambahan

source: Spatial Reference System
my: Sistem Rujukan Spatial

source: A spatial reference system (SRS) or coordinate reference system (CRS) is a coordinate-based local, regional or global system used to locate geographical entities. A spatial reference system defines a specific map projection, as well as transformations between different spatial reference systems. Spatial reference systems are defined by the OGC's Simple feature access using well-known text, and support has been implemented by several standards-based geographic information systems. Spatial reference systems can be referred to using a SRID integer, including EPSG codes defined by the International Association of Oil and Gas Producers. It is specified in ISO 19111:2007 Geographic information—Spatial referencing by coordinates, also published as OGC Abstract Specification, Topic 2: Spatial referencing by coordinate.
my: Sistem rujukan spatial (SRS) atau sistem rujukan koordinat (CRS) ialah tempatan berasaskan koordinat, sistem serantau atau global yang digunakan untuk mencari entiti geografi. Sistem rujukan spatial mentakrifkan peta tertentu unjuran, serta transformasi antara sistem rujukan spatial yang berbeza. Sistem rujukan ruang ialah ditakrifkan oleh akses ciri Mudah OGC menggunakan teks yang terkenal, dan sokongan telah dilaksanakan oleh beberapa orang sistem maklumat geografi berasaskan piawaian. Sistem rujukan spatial boleh dirujuk menggunakan integer SRID, termasuk kod EPSG yang ditakrifkan oleh Persatuan Pengeluar Minyak dan Gas Antarabangsa. Ia dinyatakan dalam ISO 19111:2007 Maklumat geografi—Rujukan spatial mengikut koordinat, juga diterbitkan sebagai Spesifikasi Abstrak OGC, Topik 2: Rujukan ruang mengikut koordinat.

source: Identifiers
my: Pengecam

source: A Spatial Reference System Identifier (SRID) is a unique value used to unambiguously identify projected, unprojected, and local spatial coordinate system definitions. These coordinate systems form the heart of all GIS applications. Virtually all major spatial vendors have created their own SRID implementation or refer to those of an authority, such as the European Petroleum Survey Group (EPSG).
my: Pengecam Sistem Rujukan Spatial (SRID) ialah nilai unik yang digunakan untuk mengenal pasti dengan jelas yang diunjurkan, tidak diunjurkan, dan definisi sistem koordinat spatial tempatan. Sistem koordinat ini membentuk nadi kepada semua aplikasi GIS. Hampir semua vendor spatial utama telah mencipta pelaksanaan SRID mereka sendiri atau merujuk kepada pihak berkuasa, seperti European Petroleum Survey Group (EPSG).

source: NOTE: As of 2005 the EPSG SRID values are now maintained by the International Association of Oil & Gas Producers (OGP) Surveying & Positioning Committee
my: NOTA: Pada tahun 2005, nilai EPSG SRID kini dikekalkan oleh Antarabangsa Jawatankuasa Ukur & Kedudukan Persatuan Pengeluar Minyak & Gas (OGP)

source: SRIDs are the primary key for the Open Geospatial Consortium (OGC) spatial_ref_sys metadata table for the Simple Features for SQL Specification, Versions 1.1 and 1.2, which is defined as follows:
my: SRID ialah kunci utama untuk jadual metadata spatial_ref_sys Open Geospatial Consortium (OGC) untuk Simple Ciri untuk Spesifikasi SQL, Versi 1.1 dan 1.2, yang ditakrifkan seperti berikut:

source: In spatially enabled databases (such as IBM DB2, IBM Informix, Microsoft SQL Server, MySQL, Oracle RDBMS, Teradata, PostGIS and SQL Anywhere), SRIDs are used to uniquely identify the coordinate systems used to define columns of spatial data or individual spatial objects in a spatial column (depending on the spatial implementation). SRIDs are typically associated with a well known text (WKT) string definition of the coordinate system (SRTEXT, above). From the Well Known Text Wikipedia page
my: Dalam pangkalan data yang didayakan secara spatial (seperti IBM DB2, IBM Informix, Microsoft SQL Server, MySQL, Oracle RDBMS, Teradata, PostGIS dan SQL Anywhere), SRID digunakan untuk mengenal pasti secara unik sistem koordinat yang digunakan untuk menentukan lajur data spatial atau individu. objek spatial dalam lajur spatial (bergantung pada pelaksanaan spatial). SRID biasanya dikaitkan dengan yang terkenal takrifan rentetan teks (WKT) bagi sistem koordinat (SRTEXT, di atas). Dari halaman Wikipedia Teks Terkenal

source: “A WKT string for a spatial reference system describes the datum, geoid, coordinate system, and map projection of the spatial objects”.
my: “Rentetan WKT untuk sistem rujukan spatial menerangkan datum, geoid, sistem koordinat, dan unjuran peta bagi objek spatial”.

source: Here are two common coordinate systems with their EPSG SRID value followed by their well known text:
my: Berikut ialah dua sistem koordinat biasa dengan nilai EPSG SRID mereka diikuti dengan teks terkenal mereka:

source: UTM, Zone 17N, NAD27 — SRID 2029
my: UTM, Zon 17N, NAD27 — SRID 2029

source: SRID values associated with spatial data can be used to constrain spatial operations — for instance, spatial operations cannot be performed between spatial objects with differing SRIDs in some systems, or trigger coordinate system transformations between spatial objects in others.
my: Nilai SRID yang dikaitkan dengan data spatial boleh digunakan untuk mengekang operasi spatial — contohnya, operasi spatial tidak boleh dilakukan antara objek spatial dengan SRID yang berbeza dalam beberapa sistem, atau mencetuskan transformasi sistem koordinat antara objek spatial dalam yang lain.

source: Source SRS EPSG Code is mandatory and represents the native data Spatial Reference System. This must be coherent with the Geometry values (lon/lat coordinates as an instance) stored on the geospatial dataset. If not specified on the geospatial data itself, it must be manually declared by the operator.
my: Sumber Kod SRS EPSG adalah wajib dan mewakili Sistem Rujukan Spatial data asli. Ini mesti koheren dengan Nilai geometri (koordinat lon/lat sebagai contoh) disimpan pada set data geospatial. Jika tidak dinyatakan pada data geospatial itu sendiri, ia mesti diisytiharkan secara manual oleh pengendali.

source: Target SRS EPSG Code is optional. This must be used only if we need to re-project the coordinates from Source SRS to another one.
my: Sasaran Kod EPSG SRS adalah pilihan. Ini mesti digunakan hanya jika kita perlu memproyeksikan semula koordinat dari Sumber SRS kepada yang lain.

source: Upload Layer Step: CSV Field Mapping
my: Langkah Muat Naik Lapisan Data: Pemetaan Medan CSV

source: Geospatial Data
my: Data Geospatial

source: Please indicate which attributes contain the latitude and longitude coordinates in the CSV data.
my: Sila nyatakan atribut yang mengandungi koordinat latitud dan longitud dalam data CSV.

source: With this data, GeoNode was able to guess which attributes contain the latitude and longitude coordinates, but please confirm that the correct attributes are selected below.
my: Dengan data ini, GeoNode dapat meneka atribut yang mengandungi koordinat latitud dan longitud, tetapi sila sahkan bahawa koordinat yang betul atribut dipilih di bawah.

source: Select an attribute
my: Pilih atribut

source: We did not detect columns that could be used for the latitude and longitude. Please verify that you have two columns in your csv file that can be used for the latitude and longitude.
my: Kami tidak mengesan lajur yang boleh digunakan untuk latitud dan longitud. Sila sahkan bahawa anda mempunyai dua lajur dalam fail csv anda yang boleh digunakan latitud dan longitud.

source: Your upload is either complete or you haven't resumed an earlier one.
my: Muat naik anda sama ada telah selesai atau anda belum menyambung yang lebih awal.

source: Return to
my: Kembali ke

source: Upload Form
my: Muat Naik Borang

source: Upload Layer Step: Time
my: Langkah Muat Naik Lapisan Data: Masa

source: Inspect data for
my: Periksa data untuk

source: Configure as Time-Series
my: Konfigurasikan sebagai Siri-Masa

source: Toggling this selector allows you to configure (or not) this data as a time series; in this case you will also have to select an attribute to drive the time dimension. <br><br> If GeoNode is not able to parse any of the values for the selected attribute red markers will appear to highlight the problems. <br><br> More information is provided at the bottom of the page in the "Additional Help" sections.
my: Menogol pemilih ini membolehkan anda mengkonfigurasi (atau tidak) data ini sebagai siri masa; dalam kes ini, anda juga perlu memilih atribut untuk memacu dimensi masa.<br><br> Jika GeoNode tidak dapat menghuraikan mana-mana nilai untuk penanda merah atribut yang dipilih akan muncul untuk menyerlahkan masalah.<br><br> Maklumat lanjut disediakan di bahagian bawah halaman dalam bahagian "Bantuan Tambahan".

source: No
my: Tiada

source: Use an existing timestamp attribute in the data
my: Gunakan atribut cap masa sedia ada dalam data

source: Yes: with an existing Time-Attribute
my: Ya: dengan Atribut Masa sedia ada

source: Yes: by converting data to a timestamp using standard date/time representation
my: Ya: dengan menukar data kepada cap masa menggunakan perwakilan tarikh/masa standard

source: Convert a number field into a year
my: Tukar medan nombor kepada tahun

source: Yes: by converting a number as Year
my: Ya: dengan menukar nombor sebagai Tahun

source: Convert data to a timestamp using standard date/time representation or a custom format
my: Tukar data kepada cap masa menggunakan perwakilan tarikh/masa standard atau format tersuai

source: Start Importer
my: Mulakan Pengimport

source: Date Format
my: Format tarikh

source: Text Attribute Date Format
my: Format Tarikh Atribut Teks

source: Best Guess
my: Tekaan Terbaik

source: Custom
my: Suai

source: Optional End-Time attribute
my: Atribut Masa Akhir Pilihan

source: Existing Time Attribute
my: Atribut Masa Sedia Ada

source: Convert Text Attribute
my: Tukar Atribut Teks

source: Convert Number (As Year)
my: Tukar Nombor (Sebagai Tahun)

source: Time attribute Presentation
my: Persembahan atribut masa

source: List
my: Daftar

source: of all the distinct time values
my: daripada semua nilai masa yang berbeza

source: Intervals
my: Interval

source: defined by the resolution
my: didefinisikan oleh resolusi

source: for data that is frequently updated, resolution describes the frequency of updates
my: untuk data yang diperbaharui secara berkala, resolusi menjelaskan frekuensi pemuktahiran

source: Resolution of time attribute
my: Resolusi atribut waktu

source: Enabling Time
my: Mengaktifkan Waktu

source: A layer can support one or two time attributes. If a single attribute is used, the layer is considered to contain data that is valid at single points in time. If two attributes are used, the second attribute represents the end of a valid period hence the layer is considered to contain data that is valid at certain periods in time.
my: Lapisan data boleh menyokong satu atau dua atribut masa. Jika bujang atribut digunakan, lapisan dianggap mengandungi data yang sah pada satu titik dalam masa. Jika dua atribut digunakan, atribut kedua mewakili penghujung tempoh yang sah oleh itu lapisan dipertimbangkan untuk mengandungi data yang sah pada tempoh masa tertentu.

source: Selecting an Attribute
my: Atribut yang dipilih

source: A time attribute can be
my: Atribut masa boleh

source: An existing date
my: Tarikh sedia ada

source: Text that can be converted to a timestamp
my: Teks yang boleh ditukar kepada cap masa

source: A number representing a year
my: Nombor yang mewakili satu tahun

source: For text attributes, one can specify a custom format (as part of the "Advanced Options") or use the 'best guess' approach which will try to automatically translate well-known recognized patterns into valid times.
my: Untuk atribut teks, seseorang boleh menentukan format tersuai (sebagai sebahagian daripada "Pilihan Lanjutan") atau menggunakan pendekatan 'tekaan terbaik' yang akan cuba menterjemah secara automatik corak yang dikenali ke dalam masa yang sah.

source: The 'best guess' will handle date and optional time variants of
my: 'Tekaan terbaik' akan mengendalikan varian tarikh dan masa pilihan

source: In terms of the formatting flags noted above, these are
my: Dalam hal bendera format yang disebutkan di atas, ini adalah

source: Modal Header
my: Pengepala Modal

source: Some text in the modal
my: Beberapa teks dalam modal

source: does NOT match any valid ISO-8601 Date-Time string!
my: TIDAK sepadan dengan mana-mana rentetan Tarikh-Masa ISO-8601 yang sah!

source: Valid ISO-8601 for
my: ISO-8601 yang sah untuk

source: matches a valid ISO-8601 Date-Time string!
my: sepadan dengan rentetan Tarikh-Masa ISO-8601 yang sah!

source: Not Valid ISO-8601 for
my: Tidak Sah ISO-8601 untuk

source: does NOT match any valid ISO-8601 Date-Time string!
my: TIDAK sepadan dengan mana-mana rentetan Tarikh-Masa ISO-8601 yang sah!

source: Wrong Selection
my: Pilihan yang Salah

source: Please, select one Time Attribute to test!
my: Sila pilih satu Atribut Masa untuk diuji!

source: Returning to the upload starting page in <span id="cnt">5</span>seconds
my: Kembali ke halaman permulaan muat naik dalam <span id="cnt">5</span> saat

source: Or just go
my: Atau pergi sahaja

source: now
my: sekarang

source: You are attempting to replace a vector layer with an unknown format.
my: Anda cuba menggantikan lapisan vektor dengan format yang tidak diketahui.

source: The UUID identifier from the XML Metadata is already in use in this system.
my: Pengecam UUID daripada Metadata XML sudah digunakan dalam sistem ini.

source: You are attempting to {action_type} a vector layer with a raster.
my: Anda cuba untuk {action_type} lapisan vektor dengan raster.

source: You are attempting to {action_type} a raster layer with a vector.
my: Anda sedang mencuba {action_type} lapisan raster dengan vektor.

source: You are attempting to {action_type} a vector layer with an unknown format.
my: Anda sedang mencuba {action_type} lapisan vektor dengan format yang tidak diketahui.

source: Please ensure the name is consistent with the file you are trying to {action_type}.
my: Sila pastikan nama itu konsisten dengan fail yang anda cuba {action_type}.

source: Local GeoNode layer has no geometry type.
my: Lapisan GeoNode Tempatan tidak mempunyai jenis geometri.

source: Please ensure there is at least one geometry type that is consistent with the file you are trying to {action_type}.
my: Sila pastikan terdapat sekurang-kurangnya satu jenis geometri yang konsisten dengan fail yang anda cuba {action_type}.

source: The selected Layer does not exists in the catalog.
my: Lapisan yang dipilih tidak wujud dalam katalog.

source: Please ensure that the layer structure is consistent
my: Sila pastikan bahawa struktur lapisan adalah konsisten

source: Some error occurred while trying to access the uploaded schema: {str(e)}
my: Beberapa ralat berlaku semasa cuba mengakses skema yang dimuat naik: {str(e)}

source: There was an error while attempting to upload your data. Please try again, or contact and administrator if the problem continues.
my: Terdapat ralat semasa cuba memuat naik data anda. Sila cuba lagi, atau hubungi dan pentadbir jika masalah berterusan.

source: Note: this layer's orginal metadata was populated and preserved by importing a metadata XML file. This metadata cannot be edited.
my: Nota: metadata asal lapisan ini telah diisi dan dipelihara dengan mengimport fail XML metadata. Metadata ini tidak boleh diedit.

source: You are not permitted to delete this layer
my: Anda tidak dibenarkan memadam lapisan ini

source: You do not have permissions for this layer.
my: Anda tiada hak akses untuk lapisan ini.

source: You are not permitted to modify this layer
my: Anda tidak dibenarkan mengubah suai lapisan ini

source: You are not permitted to modify this layer's metadata
my: Anda tidak dibenarkan mengubah suai metadata lapisan ini

source: You are not permitted to view this layer
my: Anda tidak dibenarkan melihat lapisan ini

source: Failed to upload the layer
my: Gagal memuat naik lapisan

source: You are attempting to replace a vector layer with a raster.
my: Anda cuba menggantikan lapisan vektor dengan raster.

source: You are attempting to replace a raster layer with a vector.
my: Anda cuba menggantikan lapisan raster dengan vektor.

source: This layer is a member of a layer group, you must remove the layer from the group before deleting.
my: Lapisan ini ialah ahli kumpulan lapisan, anda mesti membuang lapisan data daripada kumpulan sebelum memadam.

source: couldn't generate thumbnail: %s
my: tidak dapat menjana thumbnail: %s

source: Map Created
my: Peta telah dibuat

source: A Map was created
my: Peta telah dibuat

source: Map Updated
my: Peta dikemas kini

source: A Map was updated
my: Peta telah dikemas kini

source: Map Approved
my: Peta Diluluskan

source: A Map was approved by a Manager
my: Peta telah diluluskan oleh Pengurus

source: Map Published
my: Peta Diterbitkan

source: A Map was published
my: Peta telah diterbitkan

source: Map Deleted
my: Peta Dipadamkan

source: A Map was deleted
my: Peta telah dipadamkan

source: Comment on Map
my: Komen pada Peta

source: A map was commented on
my: Peta telah diulas

source: Rating for Map
my: Rating untuk peta

source: A rating was given to a map
my: Nilai rating telah diberikan pada peta

source: Featured Map URL
my: Pilihan Peta URL

source: stack order
my: urutan penempatan

source: name
my: nama

source: opacity
my: opcacity

source: styles
my: style

source: transparent
my: transparan

source: fixed
my: tetap

source: group
my: kumpulan

source: visibility
my: visibilitas

source: layer params
my: parameter layer

source: source params
my: parameter sumber

source: Map layers WMS GetCapabilities document
my: Lapisan peta dokumen WMS GetCapabilities

source: Rate this Map
my: Nilai peta ini

source: Download Map
my: Muat turun Peta

source: Map
my: Peta

source: Map Layers
my: Layer peta

source: This map uses the following layers:
my: Peta ini menggunakan lapisan berikut:

source: Documents related to this map
my: Dokumen terkait dengan peta ini

source: List of documents related to this map:
my: Senarai dokumen yang berkaitan dengan peta ini:

source: Change Permissions of this Map
my: Ubah hak akses peta ini

source: Copy this map
my: Salin peta ini

source: Duplicate this map and modify it for your own purposes
my: Duplikasi peta ini dan modifikasi sesuai kebutuhan anda

source: Create a New Map
my: Buat Peta Baharu

source: Here you can download all the layers of this map that are hosted on this GeoNode.
my: Di sini anda boleh memuat turun semua lapisan peta ini yang dihoskan pada GeoNode ini.

source: <div class="alert alert-warning">Could not find downloadable layers for this map. You can go back to
my: <div class="alert alert-warning">Tidak dapat mencari lapisan yang boleh dimuat turun untuk peta ini. Anda boleh kembali ke

source: Additionally, the map contains these layers which will not be downloaded due to security restrictions:
my: Selain itu, peta mengandungi lapisan ini yang tidak akan dimuat turun disebabkan oleh sekatan keselamatan:

source: Finally, the map contains these layers which will not be downloaded because they are not available directly from this GeoNode:
my: Akhir sekali, peta mengandungi lapisan ini yang tidak akan dimuat turun kerana ia tidak tersedia secara langsung dari GeoNode ini:

source: Downloading
my: Memuat turun

source: Retry
my: Coba lagi

source: Start downloading this map
my: Mula memuat turun peta ini

source: Download Complete
my: Muat turun selesai

source: Download Failed
my: Muat turun gagal

source: Edit Map
my: Edit Peta

source: Explore Maps
my: Lihat Peta
