Repository: zkasman/geonode
Catalog: geonode/locale/*/LC_MESSAGES/django.po
Languages: my

source: <p><strong>Error</strong> while trying to save the Geometry!</p>
my: <p><strong>Ralat</strong> semasa cuba menyimpan Geometri!</p>

source: Load Geo Limits
my: Muatkan Had Geo

source: Load Geo Limit
my: Muatkan Had Geo

source: <p><strong>No Geometry</strong> found!</p>
my: <p><strong>Tiada Geometri</strong> ditemui!</p>

source: <p>This will <strong>permanently</strong> remove the Geo Limits from the DB.</p><p>To apply them you will need to click on <strong>Apply Changes</strong> button.</p><p>Do you want to proceed?</p>
my: <p>Ini akan membuang Had Geo daripada DB <strong>secara kekal</strong> .</p><p> Untuk memohonnya, anda perlu mengklik butang <strong>Guna Perubahan</strong> .</p><p> Adakah anda mahu meneruskan?</p>

source: Delete Geo Limit
my: Padamkan Had Geo

source: <p><strong>Geo Limitsy</strong> successfully deleted!</p>
my: <p><strong>Geo Limitsy</strong> berjaya dipadamkan!</p>

source: <p><strong>Error</strong> occurred while trying to delete Geo Limits:</p>
my: <p><strong>Ralat</strong> berlaku semasa cuba memadam Had Geo:</p>

source: Choose users...
my: Pilih pengguna ...

source: Choose groups...
my: Pilih kumpulan...

source: Placeholder for status-message
my: Pemegang tempat untuk mesej status

source: Placeholder for status-message-body
my: Pemegang tempat untuk status-mesej-badan

source: About GeoNode
my: Tentang GeoNode

source: GeoNode is a geospatial content management system, a platform for the management and publication of geospatial data. It brings together mature and stable open-source software projects under a consistent and easy-to-use interface allowing non-specialized users to share data and create interactive maps.
my: GeoNode ialah sistem pengurusan kandungan geospatial, platform untuk pengurusan dan penerbitan data geospatial. Ia menghimpunkan projek perisian sumber terbuka yang matang dan stabil di bawah antara muka yang konsisten dan mudah digunakan yang membolehkan pengguna bukan pengkhususan berkongsi data dan mencipta peta interaktif.

source: Data management tools built into GeoNode allow for integrated creation of data, metadata, and map visualizations. Each dataset in the system can be shared publicly or restricted to allow access to only specific users. Social features like user profiles and commenting and rating systems allow for the development of communities around each platform to facilitate the use, management, and quality control of the data the GeoNode instance contains.
my: Alat pengurusan data terbina dalam GeoNode membolehkan penciptaan data, metadata dan visualisasi peta secara bersepadu. Setiap set data dalam sistem boleh dikongsi secara terbuka atau dihadkan untuk membenarkan akses kepada pengguna tertentu sahaja. Ciri sosial seperti profil pengguna dan sistem ulasan dan penilaian membolehkan pembangunan komuniti di sekeliling setiap platform untuk memudahkan penggunaan, pengurusan dan kawalan kualiti data yang terkandung dalam tika GeoNode.

source: It is also designed to be a flexible platform that software developers can extend, modify or integrate against to meet requirements in their own applications.
my: Ia juga direka bentuk untuk menjadi platform fleksibel yang boleh diperluaskan, diubah suai atau disepadukan oleh pembangun perisian untuk memenuhi keperluan dalam aplikasi mereka sendiri.

source: Account Inactive
my: Akaun tidak aktif

source: This account is inactive.
my: Akaun ini tidak aktif.

source: Account Pending Approval
my: Akaun Menunggu Kelulusan

source: We have sent the administrators a notice to approve your account associated with <b>%(email)s</b>. If the account is approved, you will receive a confirmation notice.
my: Kami telah menghantar notis kepada pentadbir untuk meluluskan akaun anda yang dikaitkan dengan <b>%(email)s</b> . Jika akaun diluluskan, anda akan menerima notis pengesahan.

source: Account
my: Akaun

source: E-mail Addresses
my: Alamat e-mel

source: The following e-mail addresses are associated with your account:
my: Alamat e-mel berikut dikaitkan dengan akaun anda:

source: Verified
my: Telah disahkan

source: Unverified
my: Belum disahkan

source: Primary
my: Utama

source: Make Primary
my: Jadikan Utama

source: Re-send Verification
my: Menghantar semula pengesahan

source: Warning:
my: Amaran:

source: You currently do not have any e-mail address set up. You should really add an e-mail address so you can receive notifications, reset your password, etc.
my: Pada masa ini anda tidak mempunyai sebarang alamat e-mel yang disediakan. Anda harus benar-benar menambah alamat e-mel supaya anda boleh menerima pemberitahuan, menetapkan semula kata laluan anda, dsb.

source: Add E-mail Address
my: Tambah Alamat E-mel

source: Add E-mail
my: Tambah E-mel

source: Do you really want to remove the selected e-mail address?
my: Adakah anda benar-benar mahu membuang alamat e-mel yang dipilih?

source: Hello from %(site_name)s! You're receiving this e-mail because user %(user_display)s has given yours as an e-mail address to connect their account. To confirm this is correct, go to %(activate_url)s
my: Helo daripada %(site_name)s! Anda menerima e-mel ini kerana pengguna %(user_display)s telah memberikan anda sebagai alamat e-mel untuk menyambungkan akaun mereka. Untuk mengesahkan ini betul, pergi ke %(activate_url)s

source: Thank you from %(site_name)s! %(site_domain)s
my: Terima kasih daripada %(site_name)s! %(site_domain)s

source: Please confirm email address for %(site_name)s
my: Sila sahkan alamat e-mel untuk %(site_name)s

source: You have been invited to sign up at %(site_name)s.
my: Anda telah dijemput untuk mendaftar masuk di %(site_name)s.

source: Create an account on %(site_name)s
my: Buat akaun di %(site_name)s

source: This is the email notification to confirm your password has been changed on
my: Ini ialah pemberitahuan e-mel untuk mengesahkan kata laluan anda telah ditukar

source: Change password email notification
my: Tukar pemberitahuan e-mel kata laluan

source: Hello from %(site_name)s! You're receiving this e-mail because you or someone else has requested a password for your user account. It can be safely ignored if you did not request a password reset. Click the link below to reset your password.
my: Helo daripada %(site_name)s! Anda menerima e-mel ini kerana anda atau orang lain telah meminta kata laluan untuk akaun pengguna anda. Ia boleh diabaikan dengan selamat jika anda tidak meminta tetapan semula kata laluan. Klik pautan di bawah untuk menetapkan semula kata laluan anda.

source: In case you forgot, your username is %(username)s.
my: Sekiranya anda terlupa, nama pengguna anda ialah %(username)s.

source: Thank you for using %(site_name)s! %(site_domain)s
my: Terima kasih kerana menggunakan %(site_name)s! %(site_domain)s

source: [%(site_name)s] Password reset
my: [%(site_name)s] Tetapan semula kata laluan

source: Confirm E-mail Address
my: Sahkan alamat emel

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an e-mail address for user %(user_display)s.
my: Sila sahkan bahawa <a href="mailto:%(email)s">%(email)s</a> ialah alamat e-mel untuk pengguna %(user_display)s.

source: Confirm
my: Sahkan

source: This e-mail confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new e-mail confirmation request</a>.
my: Pautan pengesahan e-mel ini telah tamat tempoh atau tidak sah. Sila <a href="%(email_url)s">keluarkan permintaan pengesahan e-mel baharu</a> .

source: Log in
my: Log Masuk

source: Log in to an existing account
my: Log masuk ke akaun sedia ada

source: Please sign in with one of your existing third party accounts. Or, <a href="%(signup_url)s">sign up</a> for a %(site_name)s account and sign in below:
my: Sila log masuk dengan salah satu akaun pihak ketiga anda yang sedia ada. Atau, <a href="%(signup_url)s">daftar masuk</a> untuk akaun %(site_name)s dan log masuk di bawah:

source: or
my: atau

source: If you have not created an account yet, then please <a href="%(signup_url)s">sign up</a> first.
my: Jika anda belum membuat akaun lagi, sila <a href="%(signup_url)s">daftar masuk</a> dahulu.

source: Forgot Password?
my: Lupa Kata Laluan?

source: Sign In
my: Log Masuk

source: Are you sure you want to log out?
my: Anda yakin untuk keluar?

source: Password change
my: Tukar kata laluan

source: Password Change
my: Tukar Kata Laluan

source: Change your password here
my: Tukar kata laluan anda di sini

source: Change my password
my: Tukar kata laluan saya

source: Password reset
my: Reset kata laluan

source: Password Reset
my: Reset Kata Laluan

source: Forgotten your password?
my: Lupa kata laluan?

source: Enter your email address below, and we'll send you an email allowing you to reset it.
my: Masukkan alamat e-mel anda di bawah, dan kami akan menghantar e-mel kepada anda yang membolehkan anda menetapkannya semula.

source: Reset my password
my: Tetapkan semula kata laluan saya

source: If you have any trouble resetting your password, contact us at <a href="mailto:%(THEME_ACCOUNT_CONTACT_EMAIL)s">%(THEME_ACCOUNT_CONTACT_EMAIL)s</a>.
my: Jika anda menghadapi masalah menetapkan semula kata laluan anda, hubungi kami di <a href="mailto:%(THEME_ACCOUNT_CONTACT_EMAIL)s">%(THEME_ACCOUNT_CONTACT_EMAIL)s</a> .

source: We have sent you an e-mail. Please contact us if you do not receive it within a few minutes.
my: Kami telah menghantar e-mel kepada anda. Sila hubungi kami jika anda tidak menerimanya dalam masa beberapa minit.

source: Change Password
my: Tukar Kata Laluan

source: Bad Token
my: Token Buruk

source: The password reset link was invalid, possibly because it has already been used. Please request a <a href="%(passwd_reset_url)s">new password reset</a>.
my: Pautan tetapan semula kata laluan tidak sah, mungkin kerana ia telah digunakan. Sila minta <a href="%(passwd_reset_url)s">tetapan semula kata laluan baharu</a> .

source: change password
my: tukar kata laluan

source: Your password is now changed.
my: Kata laluan anda kini telah ditukar.

source: Set Password
my: Tetapkan Kata Laluan

source: Password Set
my: Set Kata Laluan

source: Set your password here
my: Tetapkan kata laluan anda di sini

source: Set password
my: Tetapkan kata laluan

source: Sign up
my: Daftar Masuk

source: Sign up with one of your existing third party accounts
my: Daftar masuk dengan satu akaun pihak ketiga anda yang sedia ada

source: Create a new local account
my: Buat akaun tempatan baharu

source: Sign Up Closed
my: Daftar Masuk Ditutup

source: We are sorry, but the sign up is currently closed.
my: Kami memohon maaf, tetapi daftar masuk ditutup pada masa ini.

source: Note
my: Catatan

source: you are already logged in as %(user_display)s.
my: anda telah pun log masuk sebagai %(user_display)s.

source: Verify your email address
my: Mengesahkan alamat e-mel anda

source: We have sent an email to you for verification. Follow the link provided to finalize the signup process. Please contact us if you do not receive it within a few minutes
my: Kami telah menghantar e-mel kepada anda untuk pengesahan. Ikut pautan disediakan untuk memuktamadkan proses pendaftaran. Sila hubungi kami jika anda berbuat demikian tidak menerimanya dalam masa beberapa minit

source: Verify Your E-mail Address
my: Mengesahkan alamat e-mel anda

source: This part of the site requires us to verify that you are who you claim to be. For this purpose, we require that you verify ownership of your e-mail address.
my: Bahagian laman ini memerlukan kami mengesahkannya anda adalah yang anda dakwa. Untuk tujuan ini, kami memerlukan anda mengesahkan pemilikan alamat e-mel anda.

source: We have sent an e-mail to you for verification. Please click on the link inside this e-mail. Please contact us if you do not receive it within a few minutes.
my: Kami telah menghantar e-mel kepada anda untuk pengesahan. Sila klik pada pautan di dalam e-mel ini. Tolonglah hubungi kami jika anda tidak menerimanya dalam masa beberapa minit.

source: <strong>Note:</strong> you can still <a href="%(email_url)s">change your e-mail address</a>.
my: <strong>Nota:</strong> anda masih boleh <a href="%(email_url)s">menukar alamat e-mel anda</a> .

source: My Activity feed
my: Suapan Aktiviti Saya

source: Activity Feed
my: Suapan Aktiviti

source: Are you sure you want to run the selected
my: Adakah anda pasti mahu menjalankan yang dipilih

source: Yes, I'm sure
my: Ya saya pasti

source: GeoNode site admin
my: Laman Pentadbir GeoNode

source: GeoNode administration
my: Administrasi GeoNode

source: Delete Announcement?
my: Padamkan Pengumuman?

source: Are you sure you want to delete this announcement?
my: Adakah anda pasti mahu memadamkan pengumuman ini?

source: Edit Announcement
my: Edit Pengumuman

source: Create Announcement
my: Buat Pengumuman

source: New Announcement
my: Pengumuman Baharu

source: Level
my: Tahap

source: Announcement
my: Pengumuman

source: Published From
my: Diterbitkan Daripada

source: Published from <b>%(publish_start)s</b> to <b>%(publish_end)s</b>.
my: Diterbitkan dari <b>%(publish_start)s</b> hingga <b>%(publish_end)s</b>.

source: Announcements : %(announcement)s
my: Pengumuman : %(announcement)s

source: Back to edit your profile information
my: Kembali untuk mengubah informasi profil

source: Your current avatar:
my: Avatar semasa anda:

source: You haven't uploaded an avatar yet. Please upload one now.
my: Anda belum memuat naik avatar lagi. Sila muat naik satu sekarang.

source: Upload New Image
my: Muat Naik Imej Baharu

source: Choose new Default
my: Pilih Default baharu

source: Delete Your Avatar
my: Padamkan Avatar Anda

source: Please select the avatars that you would like to delete.
my: Silakan pilih avatar yang ingin dihapus.

source: You have no avatars to delete. Please <a href="%(avatar_change_url)s">upload one</a> now.
my: Anda tiada avatar untuk dipadamkan. Sila <a href="%(avatar_change_url)s">muat naik satu</a> sekarang.

source: Delete These
my: Hapus ini

source: GeoNode Search
my: Carian GeoNode

source: Contact Us
my: Hubungi Kami

source: Uploading...
my: Memuat naik...

source: Upload in progress...
my: Muat naik sedang dijalankan...

source: Updating Thumbnail...
my: Mengemas kini Thumbnail...

source: Message. Do you want to proceed?
my: Mesej. Adakah anda mahu meneruskan?

source: Information for Developers
my: Maklumat untuk Pembangun

source: Useful information for developers interested in GeoNode.
my: Maklumat berguna untuk pembangun yang berminat dengan GeoNode.
