Repository: zkasman/geonode
Catalog: geonode/locale/*/LC_MESSAGES/django.po
Languages: my

source: Note: this map's orginal metadata was populated by importing a metadata XML file. GeoNode's metadata import supports a subset of ISO, FGDC, and Dublin Core metadata elements. Some of your original metadata may have been lost.
my: Catatan: ini peta ini metadata asli dihuni oleh mengimpor file metadata XML. GeoNode ini metadata impor mendukung subset dari elemen metadata ISO, FGDC, dan Dublin Core. Beberapa metadata asli Anda mungkin telah hilang.

source: Return to Map
my: Kembali ke Peta

source: Remove Map
my: Buang Peta

source: Are you sure you want to remove <a href="%(map.get_absolute_url)s">%(map_title)s</a>?
my: Adakah anda pasti mahu membuang <a href="%(map.get_absolute_url)s">%(map_title)s</a> ?

source: You are not permitted to delete this map.
my: Anda tidak dibenarkan memadamkan peta ini.

source: You do not have permissions for this map.
my: Anda tiada hak akses untuk peta ini.

source: You must be logged in to save this map
my: Anda harus login untuk menyimpan peta ini

source: You are not permitted to save or edit this map.
my: Anda tidak dibenarkan menyimpan atau mengedit peta ini.

source: You are not allowed to modify this map's metadata.
my: Anda tidak dibenarkan mengubah suai metadata peta ini.

source: You are not allowed to view this map.
my: Anda tidak dibenarkan melihat peta ini.

source: error saving thumbnail
my: ralat menyimpan thumbnail

source: Message received
my: Mesej diterima

source: New message received in one of your threads
my: Mesej baharu diterima dalam salah satu urutan anda

source: Monitoring alert
my: Amaran pemantauan

source: Alert situation reported by monitoring
my: Situasi amaran dilaporkan oleh pemantauan

source: GeoNode Monitoring on {base_ctx['host']}
my: Pemantauan GeoNode pada {base_ctx['host']}

source: Enter valid email addresses.
my: Masukkan alamat e-mel yang sah.

source: Show list of services
my: Tunjukkan senarai servis

source: Process data since specific timestamp (YYYY-MM-DD HH:MM:SS format). If not provided, last sync will be used.
my: Proses data sejak cap masa tertentu (format YYYY-MM-DD HH:MM:SS). Jika tidak disediakan, penyegerakan terakhir akan digunakan.

source: Process data until specific timestamp (YYYY-MM-DD HH:MM:SS format). If not provided, now will be used.
my: Proses data sehingga cap masa tertentu (format YYYY-MM-DD HH:MM:SS). Jika tidak disediakan, sekarang akan digunakan.

source: Force check
my: Periksa paksa

source: Format of audit log (xml, json)
my: Format log audit (xml, json)

source: Should old data be preserved (default: no, data older than settings.MONITORING_DATA_TTL will be removed)
my: Sekiranya data lama dikekalkan (default: tidak, data lebih lama daripada tetapan.MONITORING_DATA_TTL akan dialih keluar)

source: Should stop on first error occured (default: no)
my: Harus berhenti apabila ralat pertama berlaku (default: tidak)

source: Should process and send notifications as well (default: no)
my: Harus memproses dan menghantar pemberitahuan juga (default: tidak)

source: Collect data from this service only
my: Kumpul data daripada servis ini sahaja

source: Show list of metrics
my: Tunjukkan senarai metrik

source: Show list of labels for metric
my: Tunjukkan senarai label untuk metrik

source: Show list of resources for metric
my: Tunjukkan senarai sumber untuk metrik

source: Data aggregation interval in seconds (default: 60)
my: Selang pengagregatan data dalam saat (default: 60)

source: Metric name
my: Nama metrik

source: Show data for specific resource in resource_type=resource_name format
my: Tunjukkan data untuk sumber tertentu dalam format resource_type=resource_name

source: Show data for specific resource
my: Tunjukkan data untuk sumber tertentu

source: Show data for specific label
my: Tunjukkan data untuk label tertentu

source: Write result to file, default GEOIP_PATH: {settings.GEOIP_PATH}
my: Tulis hasil pada fail, GEOIP_PATH default: {settings.GEOIP_PATH}

source: Fetch database from specific url. If nothing provided, default {} will be used
my: Ambil pangkalan data daripada url tertentu. Jika tiada apa yang diberikan, {} default akan digunakan

source: Overwrite file if exists
my: Tulis ganti fail jika wujud

source: Host (GeoServer)
my: Hos (GeoServer)

source: Host (GeoNode)
my: Hos (GeoNode)

source: No resource
my: Tiada sumber

source: Resource base
my: Pangkalan sumber

source: Style
my: Stail

source: Admin
my: Pentadbir

source: Other
my: Lain-lain

source: Rate
my: Nilai

source: Count
my: Nombor

source: Value
my: Nilai

source: Value numeric
my: Nilai angka

source: Bytes
my: Bait

source: Kilobytes
my: Kilobait

source: Megabytes
my: Megabait

source: Gigabytes
my: Gigabait

source: Bytes per second
my: Bait sesaat

source: Kilobytes per second
my: Kilobait sesaat

source: Megabytes per second
my: Megabait sesaat

source: Gigabytes per second
my: Gigabait sesaat

source: Seconds
my: Saat

source: Percentage
my: Peratusan

source: Not OWS
my: Bukan OWS

source: Any OWS
my: Mana-mana OWS

source: Change
my: Ubah

source: Change Metadata
my: Ubah Metadata

source: View Metadata
my: Lihat Metadata

source: Publish
my: Terbitkan

source: Geoserver event
my: Acara Geoserver

source: List of resources affected
my: Senarai sumber yang terjejas

source: Response processing time in ms
my: Masa pemprosesan tindak balas dalam ms

source: 1 minute
my: 1 minit

source: 5 minutes
my: 5 minit

source: 10 minutes
my: 10 minit

source: 30 minutes
my: 30 minit

source: 1 hour
my: 1 jam

source: Error
my: Ralat

source: Expected min/max values for user configuration
my: Nilai min/maks yang dijangkakan untuk konfigurasi pengguna

source: Marker of last delivery
my: Penanda penghantaran terakhir

source: Minimum time between subsequent notifications
my: Masa minimum antara pemberitahuan berikutnya

source: How severe would be error from this notification
my: Betapa teruknya ralat daripada pemberitahuan ini

source: Is it active
my: Adakah ia aktif

source: Value must be above
my: Nilai mestilah di atas

source: Value must be below
my: Nilai mestilah di bawah

source: Last update must not be older than
my: Kemas kini terakhir mestilah tidak lebih lama daripada

source: Max timeout for given metric before error should be raised
my: Tamat masa maksimum untuk metrik tertentu sebelum ralat harus dinaikkan

source: Monitoring & Analytics
my: Pemantauan & Analitik

source: Only superusers can monitor performance
my: Hanya pengguna super boleh memantau prestasi

source: Hi,
my: Hai,

source: Monitoring on
my: Pemantauan dihidupkan

source: has detected following problems :
my: telah mengesan masalah berikut:

source: spotted
my: dikesan

source: ago
my: yang lalu

source: emerged
my: muncul

source: User following you
my: Pengguna yang mengikuti anda

source: Another user has started following you
my: Pengguna lain telah mula mengikuti anda

source: User requested access
my: Pengguna meminta akses

source: A new user has requested access to the site
my: Seorang pengguna baharu telah meminta akses ke laman tersebut

source: Account activated
my: Akaun diaktifkan

source: This account is now active and can log in the site
my: Akaun ini kini aktif dan boleh log masuk ke laman

source: Personal info
my: Maklumat peribadi

source: Important dates
my: Tarikh penting

source: Extended profile
my: Profil lanjutan

source: Password changed successfully.
my: Kata laluan berjaya ditukar.

source: Change password: %s
my: Ubah password: %s

source: party who authored the resource
my: pihak yang mengarang sumber tersebut

source: party who has processed the data in a manner such that the resource has been modified
my: pihak yang telah memproses data dengan cara yang sumber telah diubah suai

source: party who published the resource
my: pihak yang menerbitkan sumber tersebut

source: party that accepts accountability and responsibility for the data and ensures appropriate care and maintenance of the resource
my: pihak yang menerima akauntabiliti dan tanggungjawab untuk data dan memastikan penjagaan dan penyelenggaraan sumber yang sesuai

source: party who can be contacted for acquiring knowledge about or acquisition of the resource
my: pihak yang boleh dihubungi untuk mendapatkan pengetahuan tentang atau pemerolehan sumber tersebut

source: party who distributes the resource
my: pihak yang mengagihkan sumber tersebut

source: party who uses the resource
my: pihak yang menggunakan sumber tersebut

source: party that supplies the resource
my: pihak yang membekalkan sumber

source: party who created the resource
my: pihak yang mencipta sumber tersebut

source: party that owns the resource
my: pihak yang memiliki sumber tersebut

source: key party responsible for gathering information and conducting research
my: pihak utama yang bertanggungjawab mengumpul maklumat dan menjalankan penyelidikan

source: Email Address
my: Alamat E-mel

source: Organization Name
my: Nama Organisasi

source: name of the responsible organization
my: nama organisasi yang bertanggungjawab

source: Profile
my: Profil

source: introduce yourself
my: perkenalkan diri anda

source: Position Name
my: Nama Jawatan

source: role or position of the responsible person
my: peranan atau kedudukan orang yang bertanggungjawab

source: Voice
my: Telefon

source: telephone number by which individuals can speak to the responsible organization or individual
my: nombor telefon di mana individu boleh bercakap dengan organisasi atau individu yang bertanggungjawab

source: Facsimile
my: Faksimili

source: telephone number of a facsimile machine for the responsible organization or individual
my: nombor telefon mesin faksimili untuk organisasi atau individu yang bertanggungjawab

source: Delivery Point
my: Titik Penghantaran

source: physical and email address at which the organization or individual may be contacted
my: alamat fizikal dan e-mel di mana organisasi atau individu boleh dihubungi

source: City
my: Bandar

source: city of the location
my: lokasi bandar

source: Administrative Area
my: Kawasan Pentadbiran

source: state, province of the location
my: negeri, wilayah lokasi

source: Postal Code
my: Poskod

source: ZIP or other postal code
my: ZIP atau poskod lain

source: Country
my: Negara

source: country of the physical address
my: negara alamat fizikal

source: commonly used word(s) or formalised word(s) or phrase(s) used to describe the subject (space or comma-separated
my: kata yang umum digunakan (s) atau diformalkan kata (s) atau frase (s) digunakan untuk menggambarkan subjek (spasi atau dipisahkan koma

source: Timezone
my: Zon Waktu

source: No Group
my: Tiada Kumpulan

source: All contents
my: Semua kandungan

source: No Organization Info
my: Tiada Maklumat Organisasi

source: Forgot Username
my: Terlupa Nama Pengguna

source: Enter your email address and click the submit button. <br />Your username will be sent to you.
my: Masukkan alamat e-mel anda dan klik butang hantar.<br /> Nama pengguna anda akan dihantar kepada anda.

source: Create Profile
my: Buat Profil

source: Profile of
my: Profil bagi

source: Not provided.
my: Tidak tersedia.

source: Position
my: Jawatan

source: Organization
my: Organisasi

source: Not provided
my: Tidak tersedia

source: Fax
my: Faks

source: User layers WMS GetCapabilities document
my: Dokumen WMS GetCapabilities lapisan pengguna

source: Message User
my: Mesej Pengguna

source: Edit profile
my: Edit profil

source: Connected social accounts
my: Akaun sosial yang disambungkan

source: Associated e-mails
my: E-mel yang berkaitan

source: Set/Change password
my: Tetapkan/Tukar kata laluan

source: Upload new layers
my: Muat naik lapisan data baharu

source: Create a new layer
my: Buat lapisan data baharu

source: Upload new document
my: Muat naik dokumen baharu

source: Create a new map
my: Buat peta baharu

source: My Activities
my: Aktiviti Saya

source: Notifications
my: Notifikasi

source: Announcements
my: Pengumuman

source: Invite Users
my: Jemput Pengguna

source: User Activities
my: Aktiviti Pengguna

source: Resources
my: Sumber

source: Edit Your Profile
my: Edit Profil Anda

source: Edit Profile for
my: Edit Profil untuk

source: Change your avatar
my: Ubah avatar anda

source: Update profile
my: Ubah Profil

source: Explore People
my: Lihat Pengguna

source: Your username for {site.name}
my: Nama pengguna anda untuk {site.name}

source: Your username has been emailed to you.
my: Nama pengguna anda telah dihantar melalui e-mel kepada anda.

source: No user could be found with that email address.
my: Tiada pengguna ditemui dengan alamat e-mel itu.

source: You are not permitted to save or edit this resource.
my: Anda tidak dibenarkan menyimpan atau mengedit sumber ini.

source: You are not authorized to download this resource.
my: Anda tidak dibenarkan memuat turun sumber ini.

source: No files have been found for this resource. Please, contact a system administrator.
my: Tiada fail ditemui untuk sumber ini. Sila hubungi pentadbir sistem.

source: No files found.
my: Tiada fail dijumpai.

source: Not Authorized
my: Tidak Dibenarkan

source: Session is Expired. Please login again!
my: Sesi tamat tempoh. Sila log masuk semula!

source: Permissions successfully updated!
my: Hak akses berjaya dikemas kini!

source: Error updating permissions :(
my: Ralat mengemas kini hak akses :(

source: You are not allowed to change permissions for this resource
my: Anda tidak dibenarkan menukar hak akses untuk sumber ini

source: Security Rules Cache Refreshed!
my: Cache Peraturan Keselamatan Disegarkan!

source: You cannot modify this resource!
my: Anda tidak boleh mengubah suai sumber ini!

source: Attributes/Stats Refreshed Successfully!
my: Atribut/Statistik Berjaya Disegarkan Semula!

source: GeoWebCache Tiled Layer Emptied!
my: Lapisan GeoWebCache-Tiled Dikosongkan!

source: Wrong permissions specification
my: Spesifikasi hak akses salah

source: error delivering notification
my: ralat menyampaikan pemberitahuan

source: Auto-detect
my: Auto-mendeteksi

source: Web Map Service
my: Layanan Web Peta

source: Catalogue Service
my: Layanan Katalog

source: Harvard Geospatial Library
my: Harvard Geospatial Perpustakaan

source: Service %(url)s is already registered
my: Service %(url)s telah pun didaftarkan

source: Could not connect to the service at %(url)s
my: Tidak dapat menyambung ke service di %(url)s

source: Could not find importable resources for the service at %(url)s
my: Tidak dapat mencari sumber yang boleh diimport untuk service di %(url)s

source: Found service of type %(found_type)s instead of %(service_type)s
my: Menjumpai service jenis %(found_type)s bukannya %(service_type)s

source: Local
my: Lokal

source: Cascaded
my: Mengalir

source: Harvested
my: Panen

source: Indexed
my: Diindeks

source: Live
my: Hidup

source: Resource is queued
my: Sumber beratur

source: Remote service unavailable
my: Remote service tidak tersedia

source: Service unavailable
my: Servis tidak tersedia

source: Could not contact
my: Tidak dapat menghubungi

source: Contact
my: Hubungi

source: Service Resources
my: Sumber Servis

source: No resources have been imported yet.
my: Tiada sumber telah diimport lagi.

source: Retry job
my: Cuba semula kerja

source: previous
my: sebelumnya

source: next
my: seterusnya

source: Connecting to service...
my: Menyambung ke servis…

source: Edit Service Metadata
my: Sunting Layanan Metadata

source: Import Service Resources
my: Import Sumber Servis

source: Remove Service
my: Hapus Layanan

source: Edit Service
my: Edit Servis

source: Services
my: Layanan

source: Register a new Service
my: Daftar Servis Baharu

source: No services registered
my: Tiada servis didaftarkan

source: Register Service
my: Daftar Servis

source: Register New Service
my: Daftar Servis Baharu

source: Service has been created:
my: Servis telah dibuat:

source: The following layers will be imported
my: Lapisan data berikut akan diimport

source: Remove Remote Service
my: Buang Remote Service

source: Are you sure you want to remove
my: Adakah anda pasti mahu membuang

source: Deleting service and its associated resources...
my: Memadamkan servis dan sumber berkaitannya...

source: Import resources
my: Import sumber

source: no
my: tiada

source: resources can be imported
my: sumber boleh diimport

source: - These will be cascaded through your local geoserver instance
my: - Ini akan dilantunkan melalui contoh geoserver tempatan anda

source: Clear Filter
my: Kosongkan Penapis

source: Back to service details
my: Kembali ke butiran servis

source: Import Resources
my: Import Sumber

source: Previous
my: Sebelumnya

source: All resources have already been imported
my: Semua sumber telah pun diimport

source: Harvesting resources...
my: Menuai sumber...

source: Re-scan Service for new Resources
my: Imbas semula Servis untuk Sumber baharu

source: Service registered successfully
my: Servis berjaya didaftarkan

source: The selected resources are being imported
my: Sumber yang dipilih sedang diimport

source: The selected resources have been imported
my: Sumber yang dipilih telah diimport

source: Resource is already being processed
my: Sumber sedang diproses

source: Resource {resource_id} is being processed
my: Sumber {resource_id} sedang diproses

source: Service rescanned successfully
my: Servis berjaya diimbas semula

source: You are not permitted to change this service.
my: Anda tidak dibenarkan menukar servis ini.

source: You are not permitted to remove this service.
my: Anda tidak dibenarkan membuang servis ini.

source: Service {service.name} has been deleted
my: Servis {service.name} telah dipadamkan

source: created
my: dibuat

source: deleted
my: dihapus

source: updated
my: dikemas kini

source: added a comment
my: menambah ulasan

source: updated a comment
my: mengemas kini ulasan

source: uploaded
my: telah dimuat naik

source: Recent activity
my: Aktiviti Terkini

source: to
my: kepada

source: on
my: pada

source: Not Permitted
my: Tidak Dibenarkan

source: You are not allowed to perform this operation.
my: Anda tidak dibenarkan melakukan operasi ini.

source: Please verify that you are logged in as the correct user.
my: Sila sahkan bahawa anda telah log masuk sebagai pengguna yang betul.

source: Please login or register and retry.
my: Sila log masuk atau daftar dan cuba semula.

source: Page Not Found
my: Halaman tidak ditemukan

source: The page you requested does not exist. Perhaps you are using an outdated bookmark?
my: Halaman yang anda minta tidak wujud. Mungkin anda menggunakan penanda halaman yang sudah lapuk?

source: Toggle navigation
my: Togol navigasi

source: People
my: Pengguna

source: Search
my: Cari

source: Register
my: Daftar

source: Sign in
my: Log Masuk

source: You are using an outdated browser that is not supported by GeoNode.
my: Anda menggunakan pelayar lapuk yang tidak disokong oleh GeoNode.

source: Please use a <strong>modern browser</strong> like Mozilla Firefox, Google Chrome or Safari.
my: Sila gunakan <strong>penyemak imbas moden</strong> seperti Mozilla Firefox, Google Chrome atau Safari.

source: There was a problem loading this page
my: Terdapat masalah memuatkan halaman ini

source: Please contact your GeoNode administrator (they may have received an email automatically if they configured it properly). If you are the site administrator, enable debug mode to see the actual error and fix it or file an issue in <a href="http://github.com/GeoNode/geonode/issues">GeoNode's issue tracker</a>
my: Sila hubungi pentadbir GeoNode anda (mereka mungkin telah menerima e-mel secara automatik jika mereka mengkonfigurasinya dengan betul). Jika anda pentadbir tapak, dayakan mod nyahpepijat untuk melihat ralat sebenar dan membetulkannya atau memfailkan isu dalam <a href="http://github.com/GeoNode/geonode/issues">penjejak isu GeoNode</a>

source: Add Remote Service
my: Tambah Remote Service

source: Create Map
my: Buat Peta

source: Add User
my: Tambah Pengguna

source: Powered by
my: Dijana oleh

source: version
my: versi

source: Developers
my: Pembangun

source: Username
my: Nama Pengguna

source: Password
my: Kata Laluan

source: Remember Me
my: Ingat Saya

source: Recent Activity
my: Aktiviti Terkini

source: Help
my: Bantuan

source: Log out
my: Keluar

source: Granules
my: Butiran

source: Share
my: Kongsi

source: Ratings
my: Penilaian

source: Set permissions on selected resources
my: Tetapkan hak akses pada sumber yang dipilih

source: Apply Changes
my: Simpan Perubahan

source: total
my: jumlah

source: Add Comment
my: Tambah komen

source: Log in to add a comment
my: Log masuk untuk menambah ulasan

source: By
my: Oleh

source: Submit Comment
my: Hantar Komen

source: Who can view it?
my: Siapa yang boleh melihatnya?

source: Anyone
my: Semua pengguna

source: The following users:
my: Pengguna berikut:

source: The following groups:
my: Kumpulan berikut:

source: Who can download it?
my: Siapa yang boleh memuat turunnya?

source: Who can change metadata for it?
my: Siapa yang boleh menukar metadata untuknya?

source: Who can edit data for this layer?
my: Siapa yang boleh mengedit data untuk lapisan data ini?

source: Who can edit styles for this layer?
my: Siapa yang boleh mengedit stail untuk lapisan data ini?

source: Who can manage it? (update, delete, change permissions, publish/unpublish it)
my: Siapa yang boleh menguruskannya? (kemas kini, padam, tukar hak akses, terbitkan/nyahterbitkannya)

source: Set permissions for this resource
my: Set hak akses untuk sumber ini

source: People and Groups
my: Orang dan Kumpulan

source: Geo Limits
my: Had Geo

source: Users
my: Pengguna

source: Show Geo Limits
my: Tunjukkan Had Geo

source: Upload Geo Limits
my: Muat Naik Had Geo

source: Save Geo Limits
my: Simpan Had Geo

source: Delete Geo Limits
my: Padamkan Had Geo

source: Message box
my: Kotak mesej

source: Mandatory files : SHP , DBF
my: Fail wajib : SHP , DBF

source: Upload a ZIP file containing an ESRI Shapefile. If the ZIP provides also a .prj file, you don't have to specify the EPSG SRID
my: Muat naik fail ZIP yang mengandungi ESRI Shapefile. Jika ZIP juga menyediakan fail .prj, anda tidak perlu menentukan EPSG SRID

source: Choose
my: Pilih

source: Choose a file...
my: Pilih fail...

source: Reset
my: Tetap Semula

source: Only the SRID number without the 'EPSG:' prefix!
my: Hanya nombor SRID tanpa awalan 'EPSG:'!

source: Set your desired encoding UTF-8, Big5, Big5-HKSCS ...
my: Tetapkan pengekodan UTF-8, Big5, Big5-HKSCS yang anda inginkan ...

source: Load SHP-ZIP
my: Muatkan SHP-ZIP

source: <p>This will remove the Geo Limits currently drawn on the map.</p><p>In order to store the Geo Limits you will need to <strong>save</strong> them anyway.</p><p>Do you want to proceed?</p>
my: <p>Ini akan membuang Had Geo yang dilukis pada peta pada masa ini.</p><p> Untuk menyimpan Had Geo, anda juga perlu <strong>menyimpannya</strong> .</p><p> Adakah anda mahu meneruskan?</p>

source: <p>This will override the current stored Geo Limits on the DB.</p><p>To apply them you will need to click on <strong>Apply Changes</strong> button anyway.</p><p><strong>WARNING:</strong> This operation cannot be reverted!</p><p>Do you want to proceed?</p>
my: <p>Ini akan mengatasi Had Geo yang disimpan semasa pada DB.</p><p> Untuk memohonnya, anda perlu mengklik pada butang <strong>Guna Perubahan</strong> .</p><p> <strong>AMARAN:</strong> Operasi ini tidak boleh dibalikkan!</p><p> Adakah anda mahu meneruskan?</p>

source: Save Geo Limit
my: Simpan Had Geo

source: <p>Geometry <strong>successfully</strong> saved!</p><p>To apply them you will need to click on <strong>Apply Changes</strong> button.</p>
my: <p>Geometri <strong>berjaya</strong> disimpan!</p><p> Untuk memohonnya, anda perlu mengklik butang <strong>Guna Perubahan</strong> .</p>
