Repository: zkasman/geonode
Catalog: geonode/locale/*/LC_MESSAGES/django.po
Languages: my

source: Update
my: Kemas kini

source: Next >>
my: Seterusnya >>

source: Select an option
my: Pilih satu opsyen

source: Editing details for
my: Mengedit butiran untuk

source: Return to Document
my: Kembali ke Dokumen

source: Deleting
my: Memadam

source: Remove Document
my: Buang Dokumen

source: Are you sure you want to remove <a href="%(document.get_absolute_url)s">%(document_title)s</a>?
my: Adakah anda pasti mahu membuang <a href="%(document.get_absolute_url)s">%(document_title)s</a> ?

source: Yes, I am sure
my: Ya saya pasti

source: No, don't remove it
my: Tidak, jangan keluarkannya

source: Replace Document
my: Gantikan Dokumen

source: Replace
my: Gantikan

source: Clear
my: Kosongkan

source: Upload Document's Thumbnail
my: Muat Naik Thumbnail Dokumen

source: Drop files here
my: Letakkan fail disini

source: or select them one by one:
my: atau pilih satu persatu:

source: Choose Files
my: Pilih Fail

source: Files to be uploaded
my: Fail untuk dimuat naik

source: Is Upload Metadata XML Form
my: Adakah Muat Naik Borang XML Metadata

source: Upload files
my: Memuat naik fail

source: Upload Document
my: Muat Naik Dokumen

source: Allowed document types
my: Jenis dokumen yang dibenarkan

source: Done!
my: Selesai!

source: Settings
my: Tetapan

source: Mandatory
my: Wajib

source: Optional
my: Pilihan

source: Basic Metadata
my: Metadata Asas

source: Location and Licenses
my: Lokasi dan Lesen

source: Required Metadata
my: Metadata Diperlukan

source: Optional Metadata
my: Metadata Lain

source: Choose one of the following...
my: Pilih salah satu daripada yang berikut...

source: Other, Optional, Metadata
my: Lain-lain, Pilihan, Metadata

source: Responsible Parties
my: Pihak Bertanggungjawab

source: Responsible and Permissions
my: Tanggungjawab dan Hak Akses

source: Publishing
my: Penerbitan

source: You are not allowed to view this document.
my: Anda tidak dibenarkan melihat dokumen ini.

source: You are not permitted to delete this document
my: Anda tidak dibenarkan memadamkan dokumen ini

source: You do not have permissions for this document.
my: Anda tidak mempunyai hak akses untuk dokumen ini.

source: You are not permitted to modify this document
my: Anda tidak dibenarkan mengubah suai dokumen ini

source: You are not permitted to modify this document's metadata
my: Anda tidak dibenarkan mengubah suai metadata dokumen ini

source: You are not permitted to view this document
my: Anda tidak dibenarkan melihat dokumen ini

source: Not allowed
my: Tidak dibenarkan

source: Not found
my: Tidak ditemui

source: You must set a point of contact for this resource
my: Anda mesti menetapkan titik hubungan untuk sumber ini

source: You must set an author for this resource
my: Anda mesti menetapkan pengarang untuk sumber ini

source: Favorite
my: Kegemaran

source: Add to Favorites
my: Tambah ke dalam Kegemaran

source: Go to Favorites
my: Pergi ke Kegemaran

source: Log in to add/delete Favorites.
my: Log masuk untuk menambah/memadam Kegemaran.

source: Delete from Favorites
my: Padam daripada Kegemaran

source: Favorites
my: Kegemaran

source: Favorites for
my: Kegemaran untuk

source: App Created
my: App Dibuat

source: A App was created
my: App telah dibuat

source: App Updated
my: App Dikemas Kini

source: A App was updated
my: App telah dikemas kini

source: App Approved
my: App Diluluskan

source: A App was approved by a Manager
my: App telah diluluskan oleh Pengurus

source: App Published
my: App Diterbitkan

source: A App was published
my: App telah diterbitkan

source: App Deleted
my: App Dipadamkan

source: A App was deleted
my: Satu App telah dipadamkan

source: Comment on App
my: Komen pada App

source: An App was commented on
my: Sebuah App telah diulas pada

source: Rating for App
my: Penilaian untuk App

source: A rating was given to an App
my: Penilaian telah diberikan kepada App

source: Name
my: Nama

source: projection
my: unjuran

source: center X
my: titik pusat X

source: center Y
my: titik pusat Y

source: Site URL
my: URL situs

source: Rate this
my: Nilaikan ini

source: Editing Tools
my: Alat Penyuntingan

source: Set
my: Tetapkan

source: View
my: Lihat

source: Specify which users can view or modify this map
my: Pilih pengguna yang dapat melihat atau memodifikasi peta ini

source: Change Permissions of this
my: Ubah Hak Akses ini

source: Embed Iframe
my: Benamkan Iframe

source: To embed this map, add the following code snippet and customize its properties (scrolling, width, height) based on your needs to your site
my: Untuk membenamkan peta ini, tambahkan coretan kod berikut dan sesuaikan sifatnya (menatal, lebar, tinggi) berdasarkan keperluan anda pada tapak anda

source: Download
my: Muat turun

source: Create New
my: Buat Baharu

source: Explore
my: Lihat

source: for %(map_title)s
my: untuk %(map_title)s

source: Note: this geoapp's orginal metadata was populated by importing a metadata XML file. GeoNode's metadata import supports a subset of ISO, FGDC, and Dublin Core metadata elements. Some of your original metadata may have been lost.
my: Nota: metadata asal geoapp ini telah diisi dengan mengimport fail XML metadata. Import metadata GeoNode menyokong subset elemen metadata ISO, FGDC dan Dublin Core. Beberapa metadata asal anda mungkin telah hilang.

source: Editing details for %(map_title)s
my: Mengedit butiran untuk %(map_title)s

source: New Map
my: Peta Baharu

source: Are you sure you want to remove <a href="%(resource.get_absolute_url)s">%(resource_title)s</a>?
my: Adakah anda pasti mahu membuang <a href="%(resource.get_absolute_url)s">%(resource_title)s</a> ?

source: Other Settings
my: Tetapan Lain

source: You are not permitted to delete this app.
my: Anda tidak dibenarkan memadamkan app ini.

source: You do not have permissions for this app.
my: Anda tidak mempunyai hak akses untuk app ini.

source: You must be logged in to save this app
my: Anda mesti log masuk untuk menyimpan app ini

source: You are not permitted to save or edit this app.
my: Anda tidak dibenarkan menyimpan atau mengedit app ini.

source: You are not allowed to modify this app's metadata.
my: Anda tidak dibenarkan mengubah suai metadata app ini.

source: You are not allowed to view this app.
my: Anda tidak dibenarkan melihat app ini.

source: An unknown error has occured.
my: Ralat yang tidak diketahui telah berlaku.

source: Layer Uploaded
my: Lapisan Data Dimuat Naik

source: A layer was uploaded
my: Satu lapisan data telah dimuat naik

source: Comment on Layer
my: Komen pada Lapisan Data

source: A layer was commented on
my: Satu lapisan data telah diulas pada

source: Rating for Layer
my: Rating Layer

source: A rating was given to a layer
my: Penilaian telah diberikan kepada lapisan data

source: Points
my: Titik (Points)

source: Lines
my: Garisan (Lines)

source: Polygons
my: Poligon (Polygons)

source: Layer name
my: Nama lapisan data

source: Layer title
my: Tajuk lapisan data

source: Geometry type
my: Jenis geometri

source: Create Layer
my: Buat Lapisan Data Baharu

source: Explore Layers
my: Lihat Lapisan Data

source: Create an empty layer
my: Buat lapisan data baharu

source: Add Attribute
my: Tambah Atribut

source: Create
my: Cipta

source: No title provided
my: Tiada tajuk disediakan

source: No abstract provided
my: Tiada abstrak disediakan

source: An exception occurred loading data to PostGIS
my: Pengecualian berlaku memuatkan data ke PostGIS

source: Additionally an error occured during database cleanup
my: Selain itu, ralat berlaku semasa pembersihan pangkalan data

source: Invalid Projection. Layer is missing CRS!
my: Unjuran Tidak Sah. Lapisan data tiada CRS!

source: You don't have permissions to change style for this layer
my: Anda tidak mempunyai hak akses untuk menukar stail untuk lapisan data ini

source: Bad HTTP Authorization Credentials.
my: Autorisasi HTTP Salah.

source: a short version of the name consisting only of letters, numbers, underscores and hyphens.
my: versi singkat dari nama hanya terdiri dari huruf, angka, garis bawah dan tanda hubung.

source: A group already exists with that slug.
my: Kumpulan sudah wujud dengan slug itu.

source: A group already exists with that name.
my: Kumpulan sudah wujud dengan nama itu.

source: User Identifiers
my: Pengecam Pengguna

source: Assign manager role
my: Berikan peranan pengurus

source: The following are not valid usernames: %(errors)s; not added to the group
my: Nama pengguna berikut tidak sah: %(errors)s; tidak ditambah ke dalam kumpulan

source: Group Categories
my: Kategori Kumpulan

source: Public
my: Umum

source: Public (invite-only)
my: Umum (jemputan sahaja)

source: Private
my: Sulit

source: Public: Any registered user can view and join a public group.<br>Public (invite-only):Any registered user can view the group. Only invited users can join.<br>Private: Registered users cannot see any details about the group, including membership. Only invited users can join.
my: Umum: Mana-mana pengguna berdaftar boleh melihat dan menyertai kumpulan awam.<br> Awam (jemputan sahaja): Mana-mana pengguna berdaftar boleh melihat kumpulan. Hanya pengguna yang dijemput boleh menyertai.<br> Peribadi: Pengguna berdaftar tidak dapat melihat sebarang butiran tentang kumpulan, termasuk keahlian. Hanya pengguna yang dijemput boleh menyertai.

source: Email used to contact one or all group members, such as a mailing list, shared email, or exchange group.
my: E-mel yang digunakan untuk menghubungi satu atau semua ahli kumpulan, seperti senarai mel, e-mel kongsi atau kumpulan pertukaran.

source: A space or comma-separated list of keywords
my: Ruang atau senarai kata kunci yang dipisahkan koma

source: Access
my: Akses

source: Categories
my: Kategori

source: Manager
my: Pengurus

source: Member
my: Ahli

source: Activity Feed for
my: Suapan Aktiviti untuk

source: All
my: Semua

source: Layers
my: Lapisan Data

source: Maps
my: Peta

source: Documents
my: Dokumen

source: Comments
my: Komen

source: No actions yet
my: Belum ada sebarang aktiviti

source: Explore Group Categories
my: Lihat Kategori Kumpulan

source: Create a New Group Category
my: Buat Kategori Kumpulan Baharu

source: Explore Groups
my: Lihat Kumpulan

source: Create a Group
my: Buat Kumpulan

source: Update Group
my: Kemas Kini Kumpulan

source: Remove Group
my: Buang Kumpulan

source: Create Group
my: Buat Kumpulan

source: Last Modified
my: Terakhir Diubah Suai

source: This group has not created a logo.
my: Kumpulan ini belum mencipta logo.

source: Edit Group Details
my: Edit Butiran Kumpulan

source: Manage Group Members
my: Urus Ahli Kumpulan

source: Delete this Group
my: Padamkan Kumpulan ini

source: Group Activities
my: Aktiviti Kumpulan

source: This group is <strong>%(access)s</strong>.
my: Kumpulan ini ialah <strong>%(access)s</strong> .

source: Anyone may join this group.
my: Sesiapa sahaja boleh menyertai kumpulan ini.

source: Join Group
my: Sertai kumpulan

source: Anyone may view this group but membership is by invitation only.
my: Sesiapa sahaja boleh melihat kumpulan ini tetapi keahlian adalah melalui jemputan sahaja.

source: Membership is by invitation only.
my: Keahlian adalah melalui jemputan sahaja.

source: Managers
my: Pengurus

source: Members
my: Ahli

source: Create a New Group
my: Buat Kumpulan Baharu

source: Edit Members for
my: Edit Ahli untuk

source: Current Members
my: Ahli Semasa

source: Promote
my: PROMOSI

source: Demote
my: Turun Taraf

source: Role
my: Peranan

source: Add new members
my: Tambah ahli baharu

source: Add Group Members
my: Tambah Ahli Kumpulan

source: Are you sure you want to remove the group: %(group_title)s?
my: Adakah anda pasti mahu membuang kumpulan: %(group_title)s?

source: Remove Maps/Data from Group
my: Alih keluar Peta/Data daripada Kumpulan

source: Remove selected maps/data
my: Alih keluar peta/data yang dipilih

source: Edit Group Category Details
my: Edit Butiran Kategori Kumpulan

source: Groups
my: Kumpulan

source: Create Group Category
my: Buat Kategori Kumpulan

source: Create a Group Category
my: Buat Kategori Kumpulan

source: Edit Group Category
my: Edit Kategori Kumpulan

source: Save
my: Simpan

source: The e-mail address '{email}' has already been invited.
my: Alamat e-mel '{email}' telah pun dijemput.

source: The e-mail address '{email}' has already accepted an invite.
my: Alamat e-mel '{email}' telah pun menerima jemputan.

source: An active user is already using the e-mail address '{email}'
my: Pengguna aktif sudah menggunakan alamat e-mel '{email}'

source: E-mail
my: E-mel

source: Invitations successfully sent to '%(email)s'
my: Jemputan berjaya dihantar ke '%(email)s'

source: Sorry, it was not possible to invite '%(email)s' due to the following isse: %(error)s (%(type)s)
my: Maaf, tidak mungkin untuk menjemput '%(email)s' kerana isu berikut: %(error)s (%(type)s)

source: Layer Created
my: Lapisan Data Talah Dibuat

source: A Layer was created
my: Lapisan data telah dibuat

source: Layer Updated
my: Lapisan data dikemas kini

source: A Layer was updated
my: Lapisan data telah dikemas kini

source: Layer Approved
my: Lapisan Data Diluluskan

source: A Layer was approved by a Manager
my: Lapisan data telah diluluskan oleh Pengurus

source: Layer Published
my: Lapisan Data Diterbitkan

source: A Layer was published
my: Lapisan data telah diterbitkan

source: Layer Deleted
my: Lapisan Data Dipadamkan

source: A Layer was deleted
my: Satu Lapisan Data telah dipadamkan

source: style name
my: nama stail

source: Workspace
my: Ruang Kerja

source: Store
my: Kedai

source: Is mosaic?
my: Adakah mozek?

source: Has time?
my: Ada masa?

source: Has elevation?
my: Mempunyai ketinggian?

source: Time regex
my: Regex masa

source: Elevation regex
my: Regex ketinggian

source: use featureinfo custom template?
my: gunakan templat tersuai featureinfo?

source: specifies wether or not use a custom GetFeatureInfo template.
my: menentukan sama ada atau tidak menggunakan templat GetFeatureInfo tersuai.

source: featureinfo custom template
my: templat tersuai featureinfo

source: the custom GetFeatureInfo template HTML contents.
my: kandungan HTML templat GetFeatureInfo tersuai.

source: File cannot be opened, maybe check the encoding
my: Fail tidak boleh dibuka, mungkin semak pengekodan

source: attribute name
my: nama atribut

source: name of attribute as stored in shapefile/spatial database
my: nama atribut yang tersimpan pada shapefile/database spasial

source: attribute description
my: huraian atribut

source: description of attribute to be used in metadata
my: deskripsi atribut untuk digunakan pada metadata

source: attribute label
my: label atribut

source: title of attribute as displayed in GeoNode
my: judul atribut sebagaimana yang ditampilkan pada GeoNode

source: attribute type
my: jenis atribut

source: the data type of the attribute (integer, string, geometry, etc)
my: jenis data atribut (integer, rentetan, geometri, dll)

source: visible?
my: terlihat?

source: specifies if the attribute should be displayed in identify results
my: menentukan sama ada atribut harus dipaparkan dalam hasil mengenal pasti

source: display order
my: tertib paparan

source: specifies the order in which attribute should be displayed in identify results
my: menentukan susunan atribut yang harus dipaparkan dalam mengenal pasti hasil

source: Image
my: Imej

source: Video (YouTube/VIMEO - embedded)
my: Video (YouTube/VIMEO - terbenam)

source: featureinfo type
my: jenis featureinfo

source: specifies if the attribute should be rendered with an HTML widget on GetFeatureInfo template.
my: menentukan sama ada atribut harus diberikan dengan widget HTML pada templat GetFeatureInfo.

source: count
my: kira

source: count value for this field
my: hitung nilai dari field ini

source: minimum value for this field
my: nilai minimal untuk field ini

source: maximum value for this field
my: nilai maksimal untuk field ini

source: average
my: rata-rata

source: average value for this field
my: nilai rata-rata untuk field ini

source: median
my: nilai tengah

source: median value for this field
my: nilai tengah untuk field ini

source: standard deviation
my: standar deviasi

source: standard deviation for this field
my: standar deviasi untuk field ini

source: sum
my: jumlah

source: sum value for this field
my: jumlah untuk field ini

source: unique values for this field
my: nilai unik dari field ini

source: last modified
my: terakhir diubah suai

source: date when attribute statistics were last updated
my: tarikh terakhir statistik atribut dikemas kini

source: Append to Layer
my: Tambah pada Lapisan Data

source: Return to Layer
my: Kembali ke Lapisan Data

source: Preserve Metadata XML
my: Kekalkan Metadata XML

source: Select the charset or leave default
my: Pilih set aksara atau biarkan default

source: Home
my: Laman Utama

source: Change point of contact
my: Ubah Kontak

source: Assign a new point of contact to the layers below:
my: Kontak baharu untuk penanggungjawab layer berikut:

source: Layer WMS GetCapabilities document
my: Lapisan dokumen WMS GetCapabilities

source: Filter Granules
my: Tapis Granules

source: Active Filter:
my: Penapis Aktif:

source: Granule ID
my: ID Butiran

source: Bounding Box
my: Batas Sempadan

source: Time
my: Waktu

source: Actions
my: Tindakan

source: Granule Preview
my: Previe Granule

source: Granule Remove
my: Buang Granule

source: Dimension
my: Dimensi

source: Enabled
my: Dibenarkan

source: TIME
my: MASA

source: Attribute Name
my: Nama Atribut

source: Range
my: Julat

source: Average
my: Purata

source: Median
my: Nilai tengah

source: Standard Deviation
my: Standar Deviasi

source: Rate this layer
my: Nilaikan lapisan data ini

source: Analyze with
my: Menganalisis dengan

source: Download Layer
my: Muat Turun Lapisan Data

source: Images
my: Imej

source: Click to filter the layer
my: Klik untuk menapis lapisan data

source: Do you want to filter it?
my: Adakah anda mahu menapisnya?

source: Loading...
my: Memuatkan...

source: Filter by attributes
my: Tapis mengikut atribut

source: Match
my: Padan

source: all
my: semua

source: any
my: mana-mana

source: of the following:
my: daripada yang berikut:

source: Attribute
my: Atribut

source: Feature limit
my: Had ciri

source: Pick your download format:
my: Pilih format muat turun anda:

source: No data available for this resource. Please contact a system administrator or a manager.
my: Tiada data tersedia untuk sumber ini. Sila hubungi pentadbir sistem atau pengurus.

source: Warning
my: Amaran

source: Edit Layer
my: Edit Lapisan Data

source: Upload Metadata
my: Muat naik Metadata

source: Styles
my: Stail

source: Manage
my: Mengurus

source: Layer
my: Lapisan Data

source: Append Data
my: Tambah Pada Data

source: View Layer
my: Lihat Lapisan Data

source: Attribute Information
my: Maklumat Atribut

source: ISO Feature Catalogue
my: Katalog Ciri ISO

source: Legend
my: Legenda

source: Maps using this layer
my: Senarai peta menggunakan lapisan data ini

source: List of maps using this layer:
my: Senarai peta menggunakan lapisan data ini:

source: This layer is not currently used in any maps.
my: Lapisan data ini tidak digunakan dalam mana-mana peta pada masa ini.

source: Create a map using this layer
my: Buat peta menggunakan lapisan data ini

source: Click the button below to generate a new map based on this layer.
my: Klik butang di bawah untuk menjana peta baharu berdasarkan lapisan data ini.

source: Add the layer to an existing map
my: Tambahkan lapisan data pada peta sedia ada

source: Click the button below to add the layer to the selected map.
my: Klik butang di bawah untuk menambah lapisan data pada peta yang dipilih.

source: Add to Map
my: Tambahkan pada Peta

source: Documents related to this layer
my: Dokumen terkait dengan layer ini

source: List of documents related to this layer:
my: Daftar dokumen yang terkait dengan layer ini:

source: The following styles are associated with this layer. Choose a style to view it in the preview map.
my: Stail berikut dikaitkan dengan lapisan ini. Pilih stail untuk melihatnya dalam peta previu.

source: (default style)
my: (stail default)

source: No styles associated with this layer
my: Tida ada style untuk layer ini

source: External service layer
my: Lapisan servis luaran

source: Source
my: Sumber

source: Refresh Attributes and Statistics of this layer
my: Muat semula Atribut dan Statistik lapisan data ini

source: Click the button below to allow GeoNode refreshing the list of available Layer Attributes. If the option 'WPS_ENABLED' has been also set on the backend, it will recalculate their statistics too.
my: Klik butang di bawah untuk membenarkan GeoNode menyegarkan senarai Atribut Lapisan Data yang tersedia. Jika pilihan 'WPS_ENABLED' juga telah ditetapkan pada bahagian belakang, ia juga akan mengira semula statistiknya.

source: Refresh Attributes and Statistics
my: Muat semula Atribut dan Statistik

source: Clear the Server Cache of this layer
my: Kosongkan Server Cache lapisan data ini

source: Click the button below to wipe the tile-cache of this layer.
my: Klik butang di bawah untuk memadam tile-cache lapisan data ini.

source: Empty Tiled-Layer Cache
my: Kosongkan Tiled-Layer Cache

source: Click the button below to change the permissions of this layer.
my: Klik butang di bawah untuk menukar hak akses lapisan data ini.

source: Change Layer Permissions
my: Tukar Hak Akses Lapisan Data

source: Processing...
my: Sedang memproses…

source: Updating Permissions...
my: Mengemaskini Hak Akses…

source: Remove Mosaic Granules
my: Keluarkan Butiran Mozek

source: Are you sure you want to remove Granule %(granule_id)s of the Mosaic <a href="%(layer.get_absolute_url)s">%(layer_title)s</a>?
my: Adakah anda pasti mahu membuang Granule %(granule_id)s daripada Mozek <a href="%(layer.get_absolute_url)s">%(layer_title)s</a> ?

source: This action affects the following maps:
my: Proses ini mempengaruhi peta berikut:

source: No maps are using this layer
my: Tidak ada peta yang menggunakan lapisan data ini

source: Upload Layers
my: Muat Naik Lapisan Data

source: for %(layer_title)s
my: untuk %(layer_title)s

source: Note: this layer's orginal metadata was populated and preserved by importing a metadata XML file. This metadata cannot be edited.
my: Nota: metadata asal lapisan data ini telah diisi dan dipelihara dengan mengimport fail XML metadata. Metadata ini tidak boleh diedit.

source: Note: this layer's orginal metadata was populated by importing a metadata XML file. GeoNode's metadata import supports a subset of ISO, FGDC, and Dublin Core metadata elements. Some of your original metadata may have been lost.
my: Nota: metadata asal lapisan data ini telah diisi dengan mengimport fail XML metadata. Import metadata GeoNode menyokong subset elemen metadata ISO, FGDC dan Dublin Core. Beberapa metadata asal anda mungkin telah hilang.

source: Editing details for %(layer_title)s
my: Detail editng untuk %(layer_title)s

source: Use a custom template?
my: Gunakan templat tersuai?

source: Display Order
my: Urutan Paparan

source: Display Type
my: Jenis Paparan

source: Visible
my: Kelihatan

source: ERROR
my: RALAT

source: Following items are required:
my: Perkara berikut diperlukan:

source: Upload Layer Metadata
my: Muat naik Metadata Lapisan Data

source: Remove Layers
my: Keluarkan Lapisan Data

source: Are you sure you want to remove <a href="%(layer.get_absolute_url)s">%(layer_title)s</a>?
my: Adakah anda pasti mahu membuang <a href="%(layer.get_absolute_url)s">%(layer_title)s</a> ?

source: Replace Layer
my: Gantikan Lapisan Data

source: Manage Styles
my: Urus Stail

source: Manage Available Styles for <a href="{{ layer_url }}">%(layer_title)s</a>
my: Urus Stail Tersedia untuk <a href="{{ layer_url }}">%(layer_title)s</a>

source: Layer Default Style
my: Style Default Layer
