Repository: zkasman/geonode
Catalog: geonode/locale/*/LC_MESSAGES/django.po
Languages: my

source: <p><a href="http://geonode.org/">GeoNode</a> is an open service built on open source software. We encourage you to build new applications using the components and resources it provides. This page is a starting point for developers interesting in taking full advantage of GeoNode. It also includes links to the project's source code so anyone can build and customize their own GeoNode. </p> <h3>GeoNode Software</h3> <p>All the code that runs GeoNode is open source. The code is available at <a href="http://github.com/GeoNode/geonode">http://github.com/GeoNode/geonode/</a>. The issue tracker for the project is at <a href="http://github.com/GeoNode/geonode/issues">http://github.com/GeoNode/geonode/issues</a>.</p> <p>GeoNode is built using several open source projects, each with its own community. If you are interested in contributing new features to the GeoNode, we encourage you to do so by contributing to one of the projects on which it is built:</p> <ul> <li><a href="http://geoserver.org">GeoServer</a> - Standards based server for geospatial information</li> <li><a href="http://geowebcache.org">GeoWebCache</a> - Cache engine for WMS Tiles</li><li><a href="http://openlayers.org">OpenLayers</a> - Pure JavaScript library powering the maps of GeoExt</li> <li><a href="http://pycsw.org">pycsw</a> - CSW, OpenSearch and OAI-PMH metadata catalogue server</li> </ul> <h3>What are OGC Services?</h3> <p>The data in this application is served using open standards endorsed by ISO and the <a href="http://opengeospatial.org/">Open Geospatial Consortium</a>; in particular, WMS (Web Map Service) is used for accessing maps, WFS (Web Feature Service) is used for accessing vector data, and WCS (Web Coverage Service) is used for accessing raster data. WMC (Web Map Context Documents) is used for sharing maps. You can use these services in your own applications using libraries such as OpenLayers, GeoTools, and OGR (all of which are open-source software and available at zero cost). Additionally, CSW (Catalog Service for the Web) supports access to collections of descriptive information (metadata) about data and services.</p> <h3>What is GeoWebCache?</h3> <p>GeoWebCache provides mapping tiles that are compatible with a number of mapping engines, including Google Maps, Bing Maps and OpenLayers. All the data hosted by GeoNode is also available through GeoWebCache. GeoWebCache improves on WMS by caching data and providing more responsive maps.</p> <h3>CSW Example Code</h3> <p>To interact with GeoNode's CSW you can use any CSW client (QGIS MetaSearch, GRASS, etc.). The following example illustrates a simple invocation using the OWSLib Python package:</p> <p><code>from owslib.csw import CatalogueServiceWeb</code></p> <p><code>from owslib.fes import PropertyIsLike</code></p> <p><code>csw = CatalogueServiceWeb('%(CATALOGUE_BASE_URL)s')</code></p> <p><code>anytext = PropertyIsLike('csw:AnyText', 'birds')')</code></p> <p><code>csw.getrecords2(constraints=[anytext])</code></p> <p><code>print csw.results</code></p> <p><code>print csw.records</code></p> <h3>OpenLayers Example Code</h3> <p>To include a GeoNode map layer in an OpenLayers map, first find the name for that layer. This is found in the layer's <code>name</code> field (not <code>title</code>) of the layer list. For this example, we will use the Nicaraguan political boundaries background layer, whose name is <code>risk:nicaragua_admin</code>. Then, create an instance of OpenLayers.Layer.WMS:</p> <p><code>var geonodeLayer = new OpenLayers.Layer.WMS("GeoNode Risk Data", "http://demo.geonode.org/geoserver/wms",{ layers: "risk:nicaragua_admin" });</code></p> <h3>Google Maps Example Code</h3> <p>To include a GeoNode map layer in a Google Map, include the layer namein the URL template.</p> <p><code>var tilelayer = new GTileLayer(null, null, null, {tileUrlTemplate: 'http://demo.geonode.org/geoserver/gwc/service/gmaps?layers=risk:nicaragua_admin&#38;zoom={Z}&#38;x={X}&#38;y={Y}', isPng:true, opacity:0.5 } );</code></p> <h3>Shapefile/GeoJSON/GML Output</h3> <p>To get data from the GeoNode web services use the WFS protocol. For example, to get the full Nicaraguan admin boundaries use:</p> <p><code>http://demo.geonode.org/geoserver/wfs?request=GetFeature&#38;typeName=risk:nicaragua_admin&#38;outputformat=SHAPE-ZIP</code></p> <p>Changing output format to <code>json</code>, <code>GML2</code>, <code>GML3</code>, or <code>csv</code> will get data in those formats. The WFS protocol also can handle more precise queries, specifying a bounding box or various spatial and non-spatial filters based on the attributes of the data.</p> <h3>GeoTools Example Code</h3> <p>Create a DataStore and extract a FeatureType from it, then run a Query. It is all documented on the wiki at <code>http://geotools.org/</code>.</p>
my: <p><a href="http://geonode.org/">GeoNode</a> ialah perkhidmatan terbuka yang dibina pada perisian sumber terbuka. Kami menggalakkan anda membina aplikasi baharu menggunakan komponen dan sumber yang disediakannya. Halaman ini adalah titik permulaan untuk pembangun yang menarik dalam memanfaatkan sepenuhnya GeoNode. Ia juga termasuk pautan ke kod sumber projek supaya sesiapa sahaja boleh membina dan menyesuaikan GeoNode mereka sendiri.</p> <h3> Perisian GeoNode</h3> <p> Semua kod yang menjalankan GeoNode adalah sumber terbuka. Kod ini tersedia di <a href="http://github.com/GeoNode/geonode">http://github.com/GeoNode/geonode/</a> . Penjejak isu untuk projek itu ada di <a href="http://github.com/GeoNode/geonode/issues">http://github.com/GeoNode/geonode/issues</a> .</p> <p> GeoNode dibina menggunakan beberapa projek sumber terbuka, setiap satu dengan komunitinya sendiri. Jika anda berminat untuk menyumbang ciri baharu kepada GeoNode, kami menggalakkan anda berbuat demikian dengan menyumbang kepada salah satu projek di mana ia dibina:</p> <ul> <li> <a href="http://geoserver.org">GeoServer</a> - Pelayan berasaskan piawai untuk maklumat geospatial</li> <li> <a href="http://geowebcache.org">GeoWebCache</a> - Enjin cache untuk WMS Tiles</li><li> <a href="http://openlayers.org">OpenLayers</a> - Pustaka JavaScript tulen yang menjanakan peta GeoExt</li> <li> <a href="http://pycsw.org">pycsw</a> - pelayan katalog metadata CSW, OpenSearch dan OAI-PMH</li> </ul> <h3> Apakah Perkhidmatan OGC?</h3> <p> Data dalam aplikasi ini disampaikan menggunakan piawaian terbuka yang disahkan oleh ISO dan <a href="http://opengeospatial.org/">Konsortium Geospatial Terbuka</a> ; khususnya, WMS (Web Map Service) digunakan untuk mengakses peta, WFS (Web Feature Service) digunakan untuk mengakses data vektor dan WCS (Web Coverage Service) digunakan untuk mengakses data raster. WMC (Web Map Context Documents) digunakan untuk berkongsi peta. Anda boleh menggunakan perkhidmatan ini dalam aplikasi anda sendiri menggunakan perpustakaan seperti OpenLayers, GeoTools dan OGR (semuanya adalah perisian sumber terbuka dan tersedia pada kos sifar). Selain itu, CSW (Perkhidmatan Katalog untuk Web) menyokong akses kepada koleksi maklumat deskriptif (metadata) mengenai data dan perkhidmatan.</p><h3> Apakah GeoWebCache?</h3><p> GeoWebCache menyediakan jubin pemetaan yang serasi dengan beberapa enjin pemetaan, termasuk Peta Google, Peta Bing dan OpenLayers. Semua data yang dihoskan oleh GeoNode juga tersedia melalui GeoWebCache. GeoWebCache menambah baik pada WMS dengan menyimpan data dan menyediakan peta yang lebih responsif.</p><h3> Kod Contoh CSW</h3><p> Untuk berinteraksi dengan CSW GeoNode anda boleh menggunakan mana-mana klien CSW (QGIS MetaSearch, GRASS, dll.). Contoh berikut menggambarkan seruan mudah menggunakan pakej Python OWSLib:</p><p> <code>from owslib.csw import CatalogueServiceWeb</code></p><p> <code>from owslib.fes import PropertyIsLike</code></p><p> <code>csw = CatalogueServiceWeb(&#39;%(CATALOGUE_BASE_URL)s&#39;)</code></p><p> <code>anytext = PropertyIsLike(&#39;csw:AnyText&#39;, &#39;birds&#39;)&#39;)</code></p><p> <code>csw.getrecords2(constraints=[anytext])</code></p><p> <code>print csw.results</code></p><p> <code>print csw.records</code></p><h3> Kod Contoh OpenLayers</h3><p> Untuk memasukkan lapisan peta GeoNode dalam peta OpenLayers, mula-mula cari nama untuk lapisan itu. Ini ditemui dalam medan <code>name</code> lapisan (bukan <code>title</code> ) senarai lapisan. Untuk contoh ini, kami akan menggunakan lapisan latar belakang sempadan politik Nicaragua, yang namanya <code>risk:nicaragua_admin</code> . Kemudian, buat contoh OpenLayers.Layer.WMS:</p><p> <code>var geonodeLayer = new OpenLayers.Layer.WMS(&quot;GeoNode Risk Data&quot;, &quot;http://demo.geonode.org/geoserver/wms&quot;,{ layers: &quot;risk:nicaragua_admin&quot; });</code></p><h3> Kod Contoh Peta Google</h3><p> Untuk memasukkan lapisan peta GeoNode dalam Peta Google, sertakan nama lapisan dalam templat URL.</p><p> <code>var tilelayer = new GTileLayer(null, null, null, {tileUrlTemplate: &#39;http://demo.geonode.org/geoserver/gwc/service/gmaps?layers=risk:nicaragua_admin&amp;zoom={Z}&amp;x={X}&amp;y={Y}&#39;, isPng:true, opacity:0.5 } );</code></p><h3> Shapefile/GeoJSON/GML Output</h3><p> Untuk mendapatkan data daripada perkhidmatan web GeoNode gunakan protokol WFS. Contohnya, untuk mendapatkan sempadan pentadbir Nicaragua penuh gunakan:</p><p> <code>http://demo.geonode.org/geoserver/wfs?request=GetFeature&amp;typeName=risk:nicaragua_admin&amp;outputformat=SHAPE-ZIP</code></p><p> Menukar format output kepada <code>json</code> , <code>GML2</code> , <code>GML3</code> atau <code>csv</code> akan mendapat data dalam format tersebut. Protokol WFS juga boleh mengendalikan pertanyaan yang lebih tepat, menyatakan kotak sempadan atau pelbagai penapis spatial dan bukan spatial berdasarkan atribut data.</p><h3> Kod Contoh GeoTools</h3><p> Buat DataStore dan ekstrak FeatureType daripadanya, kemudian jalankan Pertanyaan. Semuanya didokumenkan di wiki di <code>http://geotools.org/</code> .</p>

source: GeoNode's Web Services are available from the following URLs:
my: GeoNode's Web Services tersedia pada URL berikut:

source: Metadata search via CSW:
my: Vector data via WFS:

source: Metadata search via OpenSearch:
my: Carian metadata melalui OpenSearch:

source: Metadata search via OAI-PMH:
my: Carian metadata melalui OAI-PMH:

source: User Guide
my: Cara Penggunaan

source: GeoNode Help
my: Bantuan GeoNode

source: This page provides helpful information about how to use the GeoNode. You can use the sidebar links to navigate to what you want to know.
my: Halaman ini menyediakan maklumat berguna tentang cara menggunakan GeoNode. Anda boleh menggunakan pautan bar sisi untuk menavigasi ke perkara yang anda ingin ketahui.

source: <p>The GeoNode provides access to data sets and a map editing application allows users to browse existing maps and contribute their own.</p> <h4 id="browsing-data">Browsing Layers</h4> <p>The <a href="{{ url_layer_browse }}">Layers</a> tab allows you to browse data uploaded to this GeoNode.</p> <p>All data can be downloaded in a variety of formats, for use in other applications.</p> <h4 id="developer-access">Developer Access</h4> <p>The <a href="{{ url_developer }}"> Developer</a> page is the place for developers to get started building applications against the GeoNode. It includes instructions on using the web services, links to the source code of the GeoNode, and information about the open source projects used to create it.</p> <h4 id="browsing-maps">Browsing Maps</h4> <p>The GeoNode allows users to create and share maps with one another.</p> <p>The <a href="{{ url_maps_browse }}">Maps</a> tab is a gateway to map exploration on GeoNode. From here you can <strong>search for a map</strong> or <strong>create a map</strong>, which will open the <a href="{{ url_maps_new }}">Map Composer</a>.</p> <h5>Google Earth Mode</h5> <p>Any map viewed in the interactive map editor can be seen in 3D mode with the Google Earth plugin. To switch to 3D mode select the Google Earth globe logo, the rightmost button on top toolbar. If you do not have the Google Earth plugin installed you will be prompted to install it.</p> <h4 id="creating-a-map">Creating a Map</h4> <p>To create a new map go to the <a href="{{ url_maps_browse }}">Contributed Maps</a> tab and click the <a href="{{ url_maps_new }}">create your own map</a> link.</p> <p>This will take you to the <a href="{{ url_maps_new }}">Map Composer</a> with a base layer loaded.</p> <p>To add data layers from the GeoNode click on the green plus button located below the layers tab on the left hand side of the screen. This will open a dialog listing all the layers available on the GeoNode.</p> <p>To add layers to your map select them and hit the <strong>Add Layers</strong> button. When finished you may hit <strong>Done</strong> to close the dialog and go back to the map.</p> <h5>Reordering and Removing Layers</h5> <p>Change the display order of the layers listed in the data tab by simply dragging and dropping their names. The order in the map will be updated to reflect that. To turn a layer's visibility off simply uncheck it, and to remove it entirely select it and hit the red minus button.</p> <h5>Saving your map</h5> <p>Once a suitable set of layers and zoom level has been found it's time to save it so others can see it. Click the Save button--the left most icon on the top toolbar, an image of a map with a disk--on the top menu and fill out the title and abstract of the map.</p> <h4 id="exporting-a-map">Publishing a Map</h4> <p>Any map from the GeoNode can be embedded for use in another site or blog. To publish a map:</p> <ol> <li>Select the from the list of maps on the community or map page and then hit the 'Publish map' button.</li> <li>Choose your desired height and width for the widget in the wizard.</li> <li>Copy the HTML snippet provided in the wizard to any HTML page or iFrame-supporting blog post.</li> </ol> <p>This will put an interactive widget showing you map in your web page or blog post.</p> <p>Note that the <a href="{{ url_maps_new }}">Map Composer</a> also has a button to publish the map. Just be sure to save the map before publishing if there are changes that you want others to see. It publishes the last saved version, not the last viewed version.</p> <h4 id="remixing-a-map">Remixing a Map</h4> <p>Any map available can serve as a starting point for a new map.</p> <ol> <li>Open the map in the Map Composer.</li> <li>Add and remove layers as you like.</li> <li>Pan and zoom to highlight the area of interest.</li> <li><strong>IMPORTANT:</strong> Update the title, abstract, contact info and tags to reflect the new map.</li> <li>Save the map.</li> </ol> <p>You will be able to see your new map when you search for it from the <a href="{{ url_maps_browse }}">Maps</a> tab.</p>
my: <p>GeoNode menyediakan akses kepada set data dan aplikasi penyuntingan peta membolehkan pengguna menyemak imbas peta sedia ada dan menyumbang sendiri.</p> <h4 id="browsing-data"> Melayari Lapisan Data</h4> <p> Tab <a href="{{ url_layer_browse }}">Lapisan</a> membolehkan anda menyemak imbas data yang dimuat naik ke GeoNode ini.</p> <p> Semua data boleh dimuat turun dalam pelbagai format, untuk digunakan dalam aplikasi lain.</p> <h4 id="developer-access"> Akses Pembangun</h4> <p> Halaman <a href="{{ url_developer }}">Pembangun</a> ialah tempat untuk pembangun mula membina aplikasi terhadap GeoNode. Ia termasuk arahan tentang menggunakan perkhidmatan web, pautan ke kod sumber GeoNode dan maklumat tentang projek sumber terbuka yang digunakan untuk menciptanya.</p> <h4 id="browsing-maps"> Menyemak imbas Peta</h4> <p> GeoNode membolehkan pengguna membuat dan berkongsi peta antara satu sama lain.</p> <p> Tab <a href="{{ url_maps_browse }}">Peta</a> ialah pintu masuk untuk penerokaan peta pada GeoNode. Dari sini anda boleh <strong>mencari peta</strong> atau <strong>mencipta peta</strong> , yang akan membuka <a href="{{ url_maps_new }}">Komposer Peta</a> .</p> <h5> Mod Google Earth</h5> <p> Mana-mana peta yang dilihat dalam editor peta interaktif boleh dilihat dalam mod 3D dengan pemalam Google Earth. Untuk bertukar kepada mod 3D, pilih logo glob Google Earth, butang paling kanan pada bar alat atas. Jika anda tidak memasang pemalam Google Earth, anda akan digesa untuk memasangnya.</p> <h4 id="creating-a-map"> Mencipta Peta</h4> <p> Untuk membuat peta baharu pergi ke tab <a href="{{ url_maps_browse }}">Peta Sumbangan</a> dan klik pautan <a href="{{ url_maps_new }}">cipta peta anda sendiri</a> .</p> <p> Ini akan membawa anda ke <a href="{{ url_maps_new }}">Komposer Peta</a> dengan lapisan asas dimuatkan.</p> <p> Untuk menambah lapisan data daripada GeoNode klik pada butang tambah hijau yang terletak di bawah tab lapisan di sebelah kiri skrin. Ini akan membuka dialog yang menyenaraikan semua lapisan yang tersedia pada GeoNode.</p> <p> Untuk menambah lapisan pada peta anda pilihnya dan tekan butang <strong>Tambah Lapisan</strong> . Apabila selesai anda boleh menekan <strong>Selesai</strong> untuk menutup dialog dan kembali ke peta.</p> <h5> Menyusun Semula dan Mengeluarkan Lapisan</h5> <p> Tukar susunan paparan lapisan yang disenaraikan dalam tab data dengan hanya menyeret dan menjatuhkan nama mereka. Urutan dalam peta akan dikemas kini untuk mencerminkannya. Untuk mematikan keterlihatan lapisan hanya nyahtandanya, dan untuk membuang sepenuhnya dan tekan butang tolak merah.</p> <h5> Menyimpan peta anda</h5> <p> Setelah set lapisan dan tahap zum yang sesuai ditemui, tiba masanya untuk menyimpannya supaya orang lain dapat melihatnya. Klik butang Simpan--ikon paling kiri pada bar alat atas, imej peta dengan cakera--pada menu atas dan isikan tajuk dan abstrak peta.</p> <h4 id="exporting-a-map"> Menerbitkan Peta</h4> <p> Mana-mana peta daripada GeoNode boleh dibenamkan untuk digunakan dalam tapak atau blog lain. Untuk menerbitkan peta:</p> <ol> <li> Pilih daripada senarai peta pada halaman komuniti atau peta dan kemudian tekan butang 'Terbitkan peta'.</li> <li> Pilih ketinggian dan lebar yang anda inginkan untuk widget dalam wizard.</li> <li> Salin coretan HTML yang disediakan dalam wizard ke mana-mana halaman HTML atau catatan blog yang menyokong iFrame.</li> </ol><p> Ini akan meletakkan widget interaktif yang menunjukkan peta anda dalam halaman web atau catatan blog anda.</p> <p> Ambil perhatian bahawa <a href="{{ url_maps_new }}">Komposer Peta</a> juga mempunyai butang untuk menerbitkan peta. Cuma pastikan anda menyimpan peta sebelum menerbitkan jika terdapat perubahan yang anda mahu orang lain lihat. Ia menerbitkan versi terakhir yang disimpan, bukan versi terakhir dilihat.</p> <h4 id="remixing-a-map"> Mengubah semula Peta</h4> <p> Mana-mana peta yang tersedia boleh berfungsi sebagai titik permulaan untuk peta baharu.</p> <ol> <li> Buka peta dalam Komposer Peta.</li> <li> Tambah dan keluarkan lapisan yang anda suka.</li> <li> Sorot dan zum untuk menyerlahkan kawasan yang diminati.</li> <li> <strong>PENTING:</strong> Kemas kini tajuk, abstrak, maklumat hubungan dan teg untuk menggambarkan peta baharu.</li> <li> Simpan peta.</li> </ol> <p> Anda akan dapat melihat peta baharu anda apabila anda mencarinya daripada tab <a href="{{ url_maps_browse }}">Peta</a> .</p>

source: Sections
my: Bahagian

source: Browsing Layers
my: Lihat Lapisan Data

source: Developer Access
my: Akses Developer

source: Browsing Maps
my: Lihat Peta

source: Creating a Map
my: Buat Peta

source: Exporting a Map
my: Ekspor Peta

source: Remixing a Map
my: Membuat Peta

source: Welcome!
my: Selamat Datang!

source: Get Started &raquo;
my: Bermula &raquo;

source: Search for Data.
my: Cari Data.

source: Advanced Search
my: Carian Lanjutan

source: Click to search for geospatial data published by other users, organizations and public sources. Download data in standard formats.
my: Klik untuk mencari data geospatial yang diterbitkan oleh pengguna lain, organisasi dan sumber awam. Muat turun data dalam format standard.

source: Add layers
my: Tambah lapisan data

source: Explore layers
my: Lihat lapisan data

source: Data is available for browsing, aggregating and styling to generate maps which can be saved, downloaded, shared publicly or restricted to specify users only.
my: Data tersedia untuk dilayari, mengagregat dan menggayakan untuk menjana peta yang boleh disimpan, dimuat turun, dikongsi secara terbuka atau dihadkan untuk menentukan pengguna sahaja.

source: Create maps
my: Membuat peta

source: Explore maps
my: Lihat peta

source: As for the layers and maps GeoNode allows to publish tabular and text data, manage theirs metadata and associated documents.
my: Bagi lapisan data dan peta GeoNode membenarkan untuk menerbitkan data jadual dan teks, mengurus metadata mereka dan dokumen berkaitan.

source: Add documents
my: Tambah dokumen

source: Explore documents
my: Lihat Dokumen

source: Geonode allows registered users to easily upload geospatial data and various documents in several formats.
my: Geonode membolehkan pengguna berdaftar memuat naik data geospatial dan pelbagai dokumen dalam beberapa format dengan mudah.

source: See users
my: Lihat pengguna

source: Featured Datasets
my: Set Data Pilihan

source: Accept
my: Terima

source: Reject
my: Tolak

source: Leave
my: Tinggalkan

source: Dear Sir/Madam,
my: Tuan / Puan,

source: is inviting you to join (%(site_name)s).
my: sedang menjemput anda untuk menyertai (%(site_name)s).

source: To do so, please register at <a href="%(invite_url)s">%(site_name)s Registration</a>.
my: Untuk berbuat demikian, sila daftar di <a href="%(invite_url)s">%(site_name)s Pendaftaran</a> .

source: Once you receive the confirmation that your account is activated, you can notify
my: Sebaik sahaja anda menerima pengesahan bahawa akaun anda diaktifkan, anda boleh memberitahu

source: that you wish to join her/his group(s) through
my: bahawa anda ingin menyertai kumpulannya melalui

source: this link
my: pautan ini

source: <strong>%(inviter_name)s</strong> is a member of the following group(s):
my: <strong>%(inviter_name)s</strong> ialah ahli kumpulan berikut:

source: We look forward to seeing you on the platform,
my: Kami teruja untuk melihat anda di platform,

source: The GeoNode team.
my: Pasukan GeoNode.

source: is inviting you to join
my: sedang menjemput anda untuk menyertai

source: To do so, please register at
my: Untuk berbuat demikian, sila daftar di

source: that you wish to join her/his group(s) through this link
my: bahawa anda ingin menyertai kumpulannya melalui pautan ini

source: is a member of the following group(s)
my: adalah ahli kumpulan berikut

source: Updating Metadata...
my: Mengemas kini Metadata...

source: Topic Category is mandatory and cannot be empty!
my: Kategori Topik adalah wajib dan tidak boleh kosong!

source: Group is mandatory and cannot be empty!
my: Kumpulan adalah wajib dan tidak boleh kosong!

source: Identification
my: Identifikasi

source: Yes
my: Ya

source: Published
my: Diterbitkan

source: Information
my: Maklumat

source: Identification Image
my: Imej Pengenalan

source: Projection System
my: Sistem Unjuran

source: Features
my: Ciri-ciri

source: Contact Points
my: Titik Hubungan

source: References
my: Rujukan

source: Link Online
my: Pautan Dalam Talian

source: Metadata Page
my: Halaman Metadata

source: Online Link
my: Pautan Dalam Talian

source: * Field declared Mandatory by the Metadata Schema
my: * Medan diisytiharkan Mandatori oleh Skema Metadata

source: Please, fill the following items before clicking on preview:
my: Sila isikan perkara berikut sebelum mengklik pratonton:

source: Request perission
my: Minta pemusnahan

source: Request editing for resource:
my: Minta pengeditan untuk sumber:

source: Back to resource
my: Kembali ke sumber

source: Send request
my: Hantar permintaan

source: Your account has been approved and is now active.
my: Akaun anda telah diluluskan dan kini aktif.
