Repository: zkasman/geonode
Catalog: geonode/locale/*/LC_MESSAGES/django.po
Languages: my

source: You can use the login form at
my: Anda boleh menggunakan borang log masuk di

source: Welcome at
my: Selamat datang di

source: Your account is now active
my: Akaun anda kini aktif

source: has requested access to the site.
my: telah meminta akses ke tapak tersebut.

source: You can enable access by setting the user as active on the admin section
my: Anda boleh mendayakan akses dengan menetapkan pengguna sebagai aktif pada bahagian pentadbir

source: A user has requested access to the site
my: Seorang pengguna telah meminta akses ke tapak tersebut

source: The following document was approved
my: Dokumen berikut telah diluluskan

source: owned by
my: dimiliki oleh

source: You can visit the document's detail page here
my: Anda boleh melawati halaman butiran dokumen di sini

source: A document has been approved
my: Satu dokumen telah diluluskan

source: A comment has been posted for the document
my: Ulasan telah disiarkan untuk dokumen itu

source: by the user
my: oleh pengguna

source: A comment has been posted for a document
my: Ulasan telah disiarkan untuk dokumen

source: The user
my: Pengguna

source: uploaded the following document
my: memuat naik dokumen berikut

source: A document has been uploaded
my: Satu dokumen telah dimuat naik

source: The following document was deleted
my: Dokumen berikut telah dipadamkan

source: A document has been deleted
my: Satu dokumen telah dipadamkan

source: The following document was published
my: Dokumen berikut telah diterbitkan

source: A document has been published
my: Satu dokumen telah diterbitkan

source: rated
my: dinilai

source: the following document
my: dokumen berikut

source: You can visit the layer's detail page here
my: Anda boleh melawati halaman butiran lapisan data di sini

source: A document has been rated
my: Satu dokumen telah dinilai

source: The following document was updated
my: Dokumen berikut telah dikemas kini

source: A document has been updated
my: Satu dokumen telah dikemas kini

source: You have received the following notice from
my: Anda telah menerima notis berikut daripada

source: To change how you receive notifications, please go to
my: Untuk menukar cara anda menerima pemberitahuan, sila pergi ke

source: The following layer was approved
my: Lapisan data berikut telah diluluskan

source: A layer has been approved
my: Lapisan data telah diluluskan

source: A comment has been posted for the layer
my: Ulasan telah disiarkan untuk lapisan data

source: A comment has been posted for a layer
my: Ulasan telah disiarkan untuk lapisan data

source: uploaded the following layer
my: memuat naik lapisan data berikut

source: A new layer has been uploaded
my: Lapisan data baharu telah dimuat naik

source: The following layer was deleted
my: Lapisan data berikut telah dipadamkan

source: A layer has been deleted
my: Lapisan data telah dipadamkan

source: The following layer was published
my: Lapisan data berikut telah diterbitkan

source: A layer has been published
my: Lapisan data telah diterbitkan

source: the following layer
my: lapisan data berikut

source: A layer has been rated
my: Lapisan data telah dinilai

source: The following layer was updated
my: Lapisan data berikut telah dikemas kini

source: A layer has been updated
my: Lapisan data telah dikemas kini

source: The following map was approved
my: Peta berikut telah diluluskan

source: You can visit the map's detail page here
my: Anda boleh melawati halaman butiran peta di sini

source: A map has been approved
my: Peta telah diluluskan

source: A comment has been posted for the map
my: Ulasan telah disiarkan untuk peta

source: A comment has been posted for a map
my: Ulasan telah disiarkan untuk peta

source: created the following map
my: mencipta peta berikut

source: A map has been created
my: Peta telah dibuat

source: The following map was deleted
my: Peta berikut telah dipadamkan

source: A map has been deleted
my: Peta telah dipadamkan

source: The following map was published
my: Peta berikut telah diterbitkan

source: A map has been published
my: Peta telah diterbitkan

source: the following map
my: peta berikut

source: A map has been rated
my: Peta telah dinilai

source: The following map was updated
my: Peta berikut telah dikemas kini

source: A map has been updated
my: Peta telah dikemas kini

source: Notification Settings
my: Konfigurasi Notifikasi

source: <p class="alert alert-warning"> <span class="warning">Note</span>: You do not have a verified email address to which notices can be sent. <a href="%(email_url)s">Add one</a> now. </p>
my: <p class="alert alert-warning”> <span class="warning">Nota</span> : Anda tidak mempunyai alamat e-mel yang disahkan yang mana notis boleh dihantar. <a href="%(email_url)s">Tambah satu</a> sekarang. </p>

source: Notification Type
my: Jenis Pemberitahuan

source: requested you to download this resource
my: meminta anda memuat turun sumber ini

source: Please go to resource page and assign the download permissions if you wish
my: Sila pergi ke halaman sumber dan tetapkan hak akses muat turun jika anda mahu

source: A resource's download has been requested
my: Muat turun sumber telah diminta

source: Privacy &#038; Cookies Policy
my: Dasar Privasi & Cookies

source: Privacy &#038; Cookies Policy.
my: Dasar Privasi & Cookies.

source: Following
my: Mengikuti

source: This user is not following anyone
my: Pengguna ini tidak mengikuti siapapun

source: Followers
my: Pengikut

source: No one is following this user
my: Tidak ada yang mengikuti pengguna ini

source: Manage Connections
my: Kelola Koneksi

source: Blocking
my: Menghadang

source: Follow
my: Mengikuti

source: Unblock
my: Buka sekatan

source: Block
my: Sekat

source: No longer
my: Tidak lagi

source: You're not %(status_slug)s anyone!
my: Anda bukan %(status_slug)s siapa-siapa!

source: Success
my: Sukses

source: You are
my: Anda adalah

source: no longer
my: tidak lagi

source: %(to_user_username)s's profile
my: %(to_user_username)s's profil

source: Responsibles
my: Tanggungjawab

source: Date begins after:
my: Tarikh bermula selepas:

source: Date ends before:
my: Tarikh tamat sebelum:

source: Search by region
my: Cari mengikut wilayah

source: Selection
my: Pemilihan

source: No list items selected. Use the selection fields to add.
my: Tiada item senarai dipilih. Gunakan medan pilihan untuk menambah.

source: Filters
my: Saring

source: Layers found
my: Lapisan data ditemui

source: Maps found
my: Peta ditemui

source: Documents found
my: Dokumen ditemui

source: found
my: dijumpai

source: search
my: cari

source: Search by name
my: Cari mengikut nama

source: Total
my: Jumlah

source: Most recent
my: Yang terkini

source: Less recent
my: Paling lama

source: Most popular
my: Paling popular

source: Text
my: Teks

source: Share This
my: Kongsikan

source: Social Network Login Failure
my: Kegagalan Log Masuk Rangkaian Sosial

source: An error occurred while attempting to login via your social network account.
my: Ralat berlaku semasa cuba log masuk melalui akaun rangkaian sosial anda.

source: Code
my: Kod

source: Exception
my: Pengecualian

source: Account Connections
my: Sambungan Akaun

source: You can sign in to your account using any of the following already connected third party accounts:
my: Anda boleh log masuk ke akaun anda menggunakan mana-mana akaun pihak ketiga yang telah disambungkan berikut:

source: You currently have no social network accounts connected to this account.
my: Pada masa ini anda tidak mempunyai akaun rangkaian sosial yang disambungkan ke akaun ini.

source: Add a 3rd Party Account
my: Tambahkan Akaun Pihak Ketiga

source: Login Cancelled
my: Log Masuk Dibatalkan

source: You decided to cancel logging in to our site using one of your existing accounts. If this was a mistake, please proceed to <a href="%(login_url)s">sign in</a>.
my: Anda memutuskan untuk membatalkan log masuk ke tapak kami menggunakan salah satu akaun sedia ada anda. Jika ini satu kesilapan, sila teruskan untuk <a href="%(login_url)s">log masuk</a> .

source: Signup
my: Daftar

source: Sign Up
my: Daftar Masuk

source: You are about to use your %(provider_name)s account to login to %(site_name)s. As a final step, please complete the following form:
my: Anda akan menggunakan akaun %(provider_name)s anda untuk log masuk %(site_name)s. Sebagai langkah terakhir, sila lengkapkan borang berikut:

source: Sign in with
my: Daftar masuk dengan

source: Sign up with
my: Daftar Masuk dengan

source: Message Inbox
my: Peti Masuk Mesej

source: Messages
my: Mesej

source: Mark selected as read
my: Tandai dipilih sebagai sudah dibaca

source: Mark selected as unread
my: Tandai dipilih sebagai belum dibaca

source: Create Message
my: Cipta Mesej

source: To users
my: Kepada pengguna

source: To groups
my: Kepada kumpulan

source: Subject
my: Subyek

source: Content
my: Kandungan

source: Send message
my: Hantar mesej

source: Back to Inbox
my: Kembali ke Peti Masuk

source: Sent to
my: Dihantar kepada

source: by
my: oleh

source: You have no messages
my: Anda tiada sebarang mesej

source: Send Reply
my: Kirim Balasan

source: GeoNode Themes Library
my: Perpustakaan Tema GeoNode

source: Fill in this section with markdown
my: Isi bahagian ini dengan markdown

source: Check this if the jumbotron background image already contains text
my: Semak ini jika imej latar belakang jumbotron sudah mengandungi teks

source: Disabling this slide will hide it from the slide show
my: Melumpuhkan slaid ini akan menyembunyikannya daripada persembahan slaid

source: Choose between using jumbotron background and slide show
my: Pilih antara menggunakan latar belakang jumbotron dan tayangan slaid

source: Empty content
my: Kandungan kosong

source: Could not access to uploaded data.
my: Tidak dapat mengakses data yang dimuat naik.

source: One or more XML files was provided, but no matching files were found for them.
my: Satu atau lebih fail XML telah disediakan, tetapi tiada fail yang sepadan ditemui untuknya.

source: One or more SLD files was provided, but no matching files were found for them.
my: Satu atau lebih fail SLD telah disediakan, tetapi tiada fail yang sepadan ditemui untuknya.

source: Layer already exists
my: Lapisan data sudah wujud

source: Name already in use and overwrite is False
my: Nama yang sudah digunakan dan ditulis ganti ialah Palsu

source: Error configuring time:
my: Masa mengkonfigurasi ralat:

source: The GeoServer Import Session is no more available
my: Sesi Import GeoServer tidak tersedia lagi

source: Expected to find layer named '{name}' in geoserver
my: Dijangka untuk mencari lapisan data bernama '{name}' dalam geoserver

source: Exception occurred while parsing the provided Metadata file.
my: Pengecualian berlaku semasa menghuraikan fail Metadata yang disediakan.

source: Error configuring Layer
my: Ralat mengkonfigurasi Lapisan Data

source: Invalid zip file detected
my: Fail zip tidak sah dikesan

source: Could not find any valid spatial file inside the uploaded zip
my: Tidak dapat mencari sebarang fail spatial yang sah di dalam zip yang dimuat naik

source: Invalid kmz file detected
my: Fail kmz tidak sah dikesan

source: Could not find any kml files inside the uploaded kmz
my: Tidak dapat mencari sebarang fail kml di dalam kmz yang dimuat naik

source: Only one shapefile per zip is allowed
my: Hanya satu shapefile setiap zip dibenarkan

source: kml files with more than one GroundOverlay are not supported
my: fail kml dengan lebih daripada satu GroundOverlay tidak disokong

source: Ground overlay image declared in kml file cannot be found
my: Imej tindanan tanah yang diisytiharkan dalam fail kml tidak ditemui

source: Only one kml file per ZIP is allowed
my: Hanya satu fail kml setiap ZIP dibenarkan

source: Only one kml file per kmz is allowed
my: Hanya satu fail kml setiap kmz dibenarkan

source: You are trying to upload multiple GeoTIFFs without a valid 'indexer.properties' file.
my: Anda cuba memuat naik berbilang GeoTIFF tanpa fail 'indexer.properties' yang sah.

source: Only one raster file per ZIP is allowed
my: Hanya satu fail raster bagi setiap ZIP dibenarkan

source: No multiple rasters allowed
my: Tiada berbilang raster dibenarkan

source: To support the time step, you must enable the OGC_SERVER DATASTORE option
my: Untuk menyokong langkah masa, anda mesti mendayakan pilihan OGC_SERVER DATASTORE

source: Unsupported file type: {e.message}
my: Jenis fail tidak disokong: {e.message}

source: File does not exist: {absolute_base_file}
my: Fail tidak wujud: {absolute_base_file}

source: unknown item state: {task.state}
my: keadaan item tidak diketahui: {task.state}

source: error during import: {progress.get('message')}
my: ralat semasa import: {progress.get('message')}

source: Could not find any valid Time Regex for the Mosaic files.
my: Tidak dapat mencari sebarang Regex Masa yang sah untuk fail Mozek.

source: Unsupported DataBase for Mosaics!
my: Pangkalan Data tidak disokong untuk Mozek!

source: Upload Session invalid or no more accessible!
my: Sesi Muat Naik tidak sah atau tidak lagi boleh diakses!

source: Invalid permission level.
my: Tahap hak akses tidak sah.

source: Permission Denied
my: Hak Akses Ditolak
